
import re
import csv
import scenario_mining.exiD_scenario_mining.playground1_18 as playground1_18
import scenario_mining.exiD_scenario_mining.playground19_38 as playground19_38
import scenario_mining.exiD_scenario_mining.playground39_52 as playground39_52
import scenario_mining.exiD_scenario_mining.playground53_60 as playground53_60
import scenario_mining.exiD_scenario_mining.playground61_72 as playground61_72
import scenario_mining.exiD_scenario_mining.playground73_77 as playground73_77
import scenario_mining.exiD_scenario_mining.playground78_92 as playground78_92
from NLP.Scenario_Description_Understand import *
import streamlit as st
import pandas as pd
from GUI.Web_Sidebar import *
from utils.helper_original_scenario import generate_xosc
import sympy as sp
import matplotlib.pyplot as plt
import matplotlib.animation as animation
from utils.prompt_engineering import *
from NLP.Scenario_Description_Understand import *
from scenario_mining.activity_identification import *
from scenario_mining.scenario_identification import *
import scenario_mining.junctions_scenario_mining.bendplatz_01 as bendplatz
import scenario_mining.junctions_scenario_mining.frankenburg_02 as frankenburg
import scenario_mining.junctions_scenario_mining.heckstrasse_03 as heckstrasse
import scenario_mining.junctions_scenario_mining.aseag_04 as aseag
import xml.etree.ElementTree as ET
import math
import matplotlib.pyplot as plt
from matplotlib.patches import PathPatch
from matplotlib.path import Path
import numpy as np
import pandas as pd
import matplotlib
matplotlib.use('Agg')  # 或 'Qt5Agg', 'GTK3Agg', 'WXAgg' 等，取决于你的系统配置
import matplotlib.pyplot as plt
from shapely.geometry import Polygon
import shapely.wkt
import pickle
import json
from shapely.geometry import mapping
import json
from shapely.geometry import shape, Polygon

'''
def add_ramps_to_json_data(json_data, json_data_OffRamp, json_data_OnRamp):
    for key, value in json_data_OffRamp.items():
        polygon_dict, index = value
        json_data.append([index, polygon_dict, 'OffRamp'])
    
    for key, value in json_data_OnRamp.items():
        polygon_dict, index = value
        json_data.append([index, polygon_dict, 'OnRamp'])
    
    return json_data
'''
def get_utm_origin(recordings_meta_file):
    """
    从XX_recordingsMeta.csv文件中提取xUtmOrigin和yUtmOrigin值。
    
    参数:
    recordings_meta_file (str): XX_recordingsMeta.csv文件路径
    
    返回:
    tuple: (xUtmOrigin, yUtmOrigin)
    """
    with open(recordings_meta_file, 'r') as file:
        reader = csv.DictReader(file)
        for row in reader:
            x_utm_origin = float(row['xUtmOrigin'])
            y_utm_origin = float(row['yUtmOrigin'])
            return x_utm_origin, y_utm_origin
    raise ValueError("xUtmOrigin和yUtmOrigin在recordings meta文件中未找到")

def select_playground(file_path):
    """
    根据文件名中的数字选择对应的playground模块并执行相应的操作。

    参数:
    ----------
    file_path (str): 包含数字索引的文件路径，用于决定处理逻辑。

    返回:
    ----------
    None
    """
    # Initialize the plot
    fig, ax = plt.subplots()
    # 从文件名中提取数字
    match = re.search(r'\d+', file_path)
    if match:
        index = int(match.group(0))
        # 根据不同的数字范围选择对应的playground模块
        if 0 <= index <= 18:
            # 定义多边形的顶点
            onramp_polygon_1_18_coords = [(282, -131), (355, -210), (358, -207), (284, -127), (282, -131)]

            onramp_polygon_1_18 = Polygon(onramp_polygon_1_18_coords)

            offramp_polygon_1_18_coords = [(374, -160), (395, -191), (432, -244), (435, -242), (378, -157), (374, -160)]
            offramp_polygon_1_18 = Polygon(offramp_polygon_1_18_coords)
            # 提供的 JSON 数据
            json_data = [
                [
                    1,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    278.2847802300239,
                                    -68.28092145547271
                                ],
                                [
                                    302.053729856445,
                                    -99.01711041945964
                                ],
                                [
                                    341.5536070037633,
                                    -150.50600938219577
                                ],
                                [
                                    404.015857748338,
                                    -232.06003621127456
                                ],
                                [
                                    468.42643810703885,
                                    -316.21292255073786
                                ],
                                [
                                    518.0983297112398,
                                    -380.7375992992893
                                ],
                                [
                                    565.6732355263084,
                                    -443.1176361842081
                                ],
                                [
                                    592.2262458913028,
                                    -478.28804612066597
                                ],
                                [
                                    595.1432088135043,
                                    -475.96898970846087
                                ],
                                [
                                    568.517238310189,
                                    -440.9959609368816
                                ],
                                [
                                    521.1563677398954,
                                    -378.4508457351476
                                ],
                                [
                                    471.68376324500423,
                                    -313.7131992755458
                                ],
                                [
                                    407.4056204241351,
                                    -230.03073590248823
                                ],
                                [
                                    344.41979613661533,
                                    -148.14884167257696
                                ],
                                [
                                    304.7899339782307,
                                    -96.69401827827096
                                ],
                                [
                                    281.176278100349,
                                    -65.50648467894644
                                ],
                                [
                                    278.2847802300239,
                                    -68.28092145547271
                                ]
                            ]
                        ]
                    }
                ],
                [
                    2,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    281.176278100349,
                                    -65.50648467894644
                                ],
                                [
                                    304.7899339782307,
                                    -96.69401827827096
                                ],
                                [
                                    344.41979613661533,
                                    -148.14884167257696
                                ],
                                [
                                    407.4056204241351,
                                    -230.03073590248823
                                ],
                                [
                                    471.68376324500423,
                                    -313.7131992755458
                                ],
                                [
                                    521.1563677398954,
                                    -378.4508457351476
                                ],
                                [
                                    568.517238310189,
                                    -440.9959609368816
                                ],
                                [
                                    595.1432088135043,
                                    -475.96898970846087
                                ],
                                [
                                    597.7939362504985,
                                    -473.6040585162118
                                ],
                                [
                                    571.3793934920104,
                                    -438.6628754064441
                                ],
                                [
                                    524.17645837483,
                                    -376.27572779357433
                                ],
                                [
                                    474.9058749125106,
                                    -311.2921170219779
                                ],
                                [
                                    410.5690287416801,
                                    -227.48205582611263
                                ],
                                [
                                    347.5037615931942,
                                    -145.34914367552847
                                ],
                                [
                                    308.23519699892495,
                                    -93.94504444487393
                                ],
                                [
                                    284.2456872285111,
                                    -62.81778566259891
                                ],
                                [
                                    281.176278100349,
                                    -65.50648467894644
                                ]
                            ]
                        ]
                    }
                ],
                [
                    3,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    370.49833874450997,
                                    -164.17523724306375
                                ],
                                [
                                    414.2029782922473,
                                    -224.43043146189302
                                ],
                                [
                                    463.9402883455041,
                                    -296.8572966000065
                                ],
                                [
                                    474.9058749125106,
                                    -311.2921170219779
                                ],
                                [
                                    524.17645837483,
                                    -376.27572779357433
                                ],
                                [
                                    571.3793934920104,
                                    -438.6628754064441
                                ],
                                [
                                    597.7939362504985,
                                    -473.6040585162118
                                ],
                                [
                                    599.8424440906965,
                                    -470.60003031324595
                                ],
                                [
                                    580.9387144310749,
                                    -445.43545870296657
                                ],
                                [
                                    526.9216672151815,
                                    -373.958112728782
                                ],
                                [
                                    477.73136994300876,
                                    -308.78664700407535
                                ],
                                [
                                    416.65450132638216,
                                    -221.6445157788694
                                ],
                                [
                                    394.9449618161307,
                                    -190.8647281276062
                                ],
                                [
                                    372.7636280420702,
                                    -161.27871040720493
                                ],
                                [
                                    370.49833874450997,
                                    -164.17523724306375
                                ]
                            ]
                        ]
                    }
                ],
                [
                    4,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    374.4888390492415,
                                    -159.7541891876608
                                ],
                                [
                                    394.9449618161307,
                                    -190.8647281276062
                                ],
                                [
                                    416.65450132638216,
                                    -221.6445157788694
                                ],
                                [
                                    477.73136994300876,
                                    -308.78664700407535
                                ],
                                [
                                    526.9216672151815,
                                    -373.958112728782
                                ],
                                [
                                    580.9387144310749,
                                    -445.43545870296657
                                ],
                                [
                                    562.9689124572906,
                                    -416.39214814733714
                                ],
                                [
                                    529.6359066521982,
                                    -371.7245691185817
                                ],
                                [
                                    480.3468829652411,
                                    -306.3319803047925
                                ],
                                [
                                    419.0660473003518,
                                    -219.42061564140022
                                ],
                                [
                                    377.73254355299287,
                                    -157.30422125663608
                                ],
                                [
                                    374.4888390492415,
                                    -159.7541891876608
                                ]
                            ]
                        ]
                    }
                ],
                [
                    4,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    374.4888390492415,
                                    -159.7541891876608
                                ],
                                [
                                    394.9449618161307,
                                    -190.8647281276062
                                ],
                                [
                                    432.11060787690803,
                                    -243.98820682242513
                                ],
                                [
                                    434.68041734898,
                                    -241.94324372708797
                                ],
                                [
                                    377.73254355299287,
                                    -157.30422125663608
                                ],
                                [
                                    374.4888390492415,
                                    -159.7541891876608
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -1,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    272.65575653564883,
                                    -72.5970634734258
                                ],
                                [
                                    336.39145104191266,
                                    -155.64232034049928
                                ],
                                [
                                    398.9133712934563,
                                    -237.1114298524335
                                ],
                                [
                                    512.9574332652846,
                                    -385.5034197727218
                                ],
                                [
                                    587.2198447982082,
                                    -483.19663551356643
                                ],
                                [
                                    589.9398582216818,
                                    -481.00704958382994
                                ],
                                [
                                    515.4763043537969,
                                    -383.1971084205434
                                ],
                                [
                                    401.4844288995955,
                                    -234.4820140255615
                                ],
                                [
                                    339.1340694014216,
                                    -153.12261707615107
                                ],
                                [
                                    275.68927806417923,
                                    -70.36574067547917
                                ],
                                [
                                    272.65575653564883,
                                    -72.5970634734258
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -2,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    269.48172801872715,
                                    -75.26019941549748
                                ],
                                [
                                    333.1207564016804,
                                    -158.40131418779492
                                ],
                                [
                                    360.49984337366186,
                                    -194.5785504207015
                                ],
                                [
                                    452.61391461314633,
                                    -313.1382520580664
                                ],
                                [
                                    510.36197446787264,
                                    -388.2304834499955
                                ],
                                [
                                    562.3631445922074,
                                    -456.95451681222767
                                ],
                                [
                                    584.7048105150461,
                                    -485.8785347864032
                                ],
                                [
                                    587.2198447982082,
                                    -483.19663551356643
                                ],
                                [
                                    512.9574332652846,
                                    -385.5034197727218
                                ],
                                [
                                    398.9133712934563,
                                    -237.1114298524335
                                ],
                                [
                                    336.39145104191266,
                                    -155.64232034049928
                                ],
                                [
                                    272.65575653564883,
                                    -72.5970634734258
                                ],
                                [
                                    269.48172801872715,
                                    -75.26019941549748
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -3,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    266.8677170102019,
                                    -77.97903019748628
                                ],
                                [
                                    344.65700547758024,
                                    -178.99704697728157
                                ],
                                [
                                    360.49984337366186,
                                    -194.5785504207015
                                ],
                                [
                                    333.1207564016804,
                                    -158.40131418779492
                                ],
                                [
                                    269.48172801872715,
                                    -75.26019941549748
                                ],
                                [
                                    266.8677170102019,
                                    -77.97903019748628
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -4,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    259.5532058150857,
                                    -85.11782492883503
                                ],
                                [
                                    334.0283684451133,
                                    -179.91773108951747
                                ],
                                [
                                    449.2819532647263,
                                    -316.18775018304586
                                ],
                                [
                                    480.97705319186207,
                                    -357.44373666029423
                                ],
                                [
                                    562.3631445922074,
                                    -456.95451681222767
                                ],
                                [
                                    510.36197446787264,
                                    -388.2304834499955
                                ],
                                [
                                    452.61391461314633,
                                    -313.1382520580664
                                ],
                                [
                                    393.50459216273157,
                                    -242.3003060258925
                                ],
                                [
                                    327.2534539208864,
                                    -164.8254524357617
                                ],
                                [
                                    263.4830346395029,
                                    -81.9562173821032
                                ],
                                [
                                    259.5532058150857,
                                    -85.11782492883503
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -5,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    282.46261962444987,
                                    -131.11906064115465
                                ],
                                [
                                    320.86997411272023,
                                    -171.39956625830382
                                ],
                                [
                                    446.6366176751908,
                                    -318.73995826020837
                                ],
                                [
                                    449.2819532647263,
                                    -316.18775018304586
                                ],
                                [
                                    334.0283684451133,
                                    -179.91773108951747
                                ],
                                [
                                    284.4459443225642,
                                    -127.28177763149142
                                ],
                                [
                                    282.46261962444987,
                                    -131.11906064115465
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -5,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    282.46261962444987,
                                    -131.11906064115465
                                ],
                                [
                                    354.66170536749996,
                                    -209.70990161038935
                                ],
                                [
                                    357.62887006113306,
                                    -207.0684313448146
                                ],
                                [
                                    284.4459443225642,
                                    -127.28177763149142
                                ],
                                [
                                    282.46261962444987,
                                    -131.11906064115465
                                ]
                            ]
                        ]
                    }
                ]
            ]

            # 将 JSON 数据转换为包含 Polygon 对象的元组列表
            lanes_polygons_1_18 = [
                (index, shape(polygon_dict)) for index, polygon_dict in json_data
            ]
            
            if 0 <= index <= 9:
                
                input_file_1_18 = f'0{index}_tracks.csv'
                output_file_1_18 = f'0{index}_updated_tracks.csv'
            else :
                input_file_1_18 = f'{index}_tracks.csv'
                output_file_1_18 = f'{index}_updated_tracks.csv'
            #playground1_18.update_track_data(input_file_1_18, output_file_1_18, onramp_polygon_1_18, offramp_polygon_1_18, lanes_polygons_1_18)
            updated_tracks_df = playground1_18.extract_turn_type_and_lane(input_file_1_18, onramp_polygon_1_18, offramp_polygon_1_18, lanes_polygons_1_18)
            #plot_polygons_from_json(json_data, ax)
            # Set labels, title, and other plot parameters
            #ax.set_xlabel("X Coordinate")
            #ax.set_ylabel("Y Coordinate")
            #ax.set_title("Visualization of Polygons from JSON Data")
            #ax.legend()
            #ax.grid(True)
            #ax.axis('equal')

            # Show the plot
            #plt.show()
            
            return json_data, updated_tracks_df
        
        elif 19 <= index <= 38:

            onramp_polygon_19_38_coords_1 = [
                (417.9635702712694, -237.5015376629308),
                (400.2264643313829, -214.5553731545806),
                (358.43832916312385, -174.91530229430646),
                (314.6819614908309, -143.90204749349505),
                (311.43236986891134, -148.65390884503722),
                (354.7595205893158, -179.08403029013425),
                (395.4013636430609, -218.46967659518123),
                (414.14003745338414, -240.33766895905137),
                (417.9635702712694, -237.5015376629308)
            ]
            onramp_polygon_19_38_coords_2 = [
                (543.493799658725, -335.4048775937408),
                (580.8542123081279, -374.5348250856623),
                (606.472093112825, -386.2462885538116),
                (610.5825320084696, -382.49000732041895),
                (583.9023105505039, -371.73521982319653),
                (546.4489273423678, -332.77966612856835),
                (543.493799658725, -335.4048775937408)
            ]

            # 创建Polygon对象
            onramp_polygon_19_38_1 = Polygon(onramp_polygon_19_38_coords_1)
            onramp_polygon_19_38_2 = Polygon(onramp_polygon_19_38_coords_2)

            # 创建onramp_polygons_19_38字典
            onramp_polygons_19_38 = {
                'playground19-38_lane-4_OnRamp': (onramp_polygon_19_38_1, -4),
                'playground19-38_lane4_OnRamp': (onramp_polygon_19_38_2, 4)
            }
            # 从JSON数据中提取的多边形坐标和值
            offramp_polygon_19_38_coords_1 = [
                (557.5267711196211, -421.4385609002784),
                (520.4895956247346, -376.65872219670564),
                (479.5424434004235, -324.3662158176303),
                (487.58549427083926, -340.0177958542481),
                (517.5840260589612, -379.28128955326974),
                (551.7076426656567, -426.50686578452587),
                (557.5267711196211, -421.4385609002784)
            ]
            offramp_polygon_19_38_coords_2 = [
                (379.80832447629655, -81.84228744637221),
                (396.74548233364476, -130.27554988861084),
                (430.6301221573958, -187.89729742053896),
                (434.561310428835, -184.49044726602733),
                (401.79181745427195, -128.2541870670393),
                (385.1939919034485, -81.1246771691367),
                (379.80832447629655, -81.84228744637221)
            ]

            # 创建Polygon对象
            offramp_polygon_19_38_1 = Polygon(offramp_polygon_19_38_coords_1)
            offramp_polygon_19_38_2 = Polygon(offramp_polygon_19_38_coords_2)

            # 创建offramp_polygons_19_38字典
            offramp_polygons_19_38 = {
                'playground19-38_lane-5_OffRamp': (offramp_polygon_19_38_1, -5),
                'playground19-38_lane4_OffRamp': (offramp_polygon_19_38_2, 4)
            }
            # 提供的 JSON 数据
            json_data = [
                [
                    1,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    308.8621880970313,
                                    -59.10356215201318
                                ],
                                [
                                    354.5640190876438,
                                    -118.66652759723365
                                ],
                                [
                                    454.1943377442076,
                                    -248.52964199054986
                                ],
                                [
                                    576.2723304494866,
                                    -407.840584105812
                                ],
                                [
                                    578.9418257932994,
                                    -405.3973595900461
                                ],
                                [
                                    456.9036577557563,
                                    -245.97693165391684
                                ],
                                [
                                    357.0340984921786,
                                    -116.08048329409212
                                ],
                                [
                                    311.7750581847504,
                                    -56.31830155942589
                                ],
                                [
                                    308.8621880970313,
                                    -59.10356215201318
                                ]
                            ]
                        ]
                    }
                ],
                [
                    2,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    311.7750581847504,
                                    -56.31830155942589
                                ],
                                [
                                    357.0340984921786,
                                    -116.08048329409212
                                ],
                                [
                                    456.9036577557563,
                                    -245.97693165391684
                                ],
                                [
                                    578.9418257932994,
                                    -405.3973595900461
                                ],
                                [
                                    582.2572947255685,
                                    -402.3929488584399
                                ],
                                [
                                    460.03933578619035,
                                    -243.15093315858394
                                ],
                                [
                                    360.33784745965386,
                                    -113.16343545354903
                                ],
                                [
                                    314.41641447442817,
                                    -53.41711242683232
                                ],
                                [
                                    311.7750581847504,
                                    -56.31830155942589
                                ]
                            ]
                        ]
                    }
                ],
                [
                    3,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    319.29476028261706,
                                    -48.476206965744495
                                ],
                                [
                                    428.1699137362302,
                                    -190.38442600425333
                                ],
                                [
                                    540.956289619382,
                                    -337.4571679318324
                                ],
                                [
                                    587.1041600945173,
                                    -397.75375586748123
                                ],
                                [
                                    589.7894139915588,
                                    -395.53222673386335
                                ],
                                [
                                    543.493799658725,
                                    -335.4048775937408
                                ],
                                [
                                    430.6301221573958,
                                    -187.89729742053896
                                ],
                                [
                                    321.70928901137086,
                                    -45.57247888389975
                                ],
                                [
                                    319.29476028261706,
                                    -48.476206965744495
                                ]
                            ]
                        ]
                    }
                ],
                [
                    4,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    379.80832447629655,
                                    -81.84228744637221
                                ],
                                [
                                    396.74548233364476,
                                    -130.27554988861084
                                ],
                                [
                                    430.6301221573958,
                                    -187.89729742053896
                                ],
                                [
                                    543.493799658725,
                                    -335.4048775937408
                                ],
                                [
                                    580.8542123081279,
                                    -374.5348250856623
                                ],
                                [
                                    610.5825320084696,
                                    -382.49000732041895
                                ],
                                [
                                    583.9023105505039,
                                    -371.73521982319653
                                ],
                                [
                                    546.4489273423678,
                                    -332.77966612856835
                                ],
                                [
                                    434.561310428835,
                                    -184.49044726602733
                                ],
                                [
                                    401.79181745427195,
                                    -128.2541870670393
                                ],
                                [
                                    379.80832447629655,
                                    -81.84228744637221
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -1,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    573.5580388903036,
                                    -410.1542776217684
                                ],
                                [
                                    451.3923153327196,
                                    -250.53686138242483
                                ],
                                [
                                    351.57553154957714,
                                    -120.64847174379975
                                ],
                                [
                                    305.90319931466365,
                                    -61.10528236441314
                                ],
                                [
                                    302.37332523131045,
                                    -63.132339674048126
                                ],
                                [
                                    348.6576564591378,
                                    -122.77555314730853
                                ],
                                [
                                    448.4474046481773,
                                    -252.68703379668295
                                ],
                                [
                                    570.4898319427157,
                                    -412.20731523353606
                                ],
                                [
                                    573.5580388903036,
                                    -410.1542776217684
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -2,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    570.4898319427157,
                                    -412.20731523353606
                                ],
                                [
                                    448.4474046481773,
                                    -252.68703379668295
                                ],
                                [
                                    348.6576564591378,
                                    -122.77555314730853
                                ],
                                [
                                    302.37332523131045,
                                    -63.132339674048126
                                ],
                                [
                                    298.9112099871272,
                                    -65.06216375995427
                                ],
                                [
                                    345.01769594539655,
                                    -125.20385039877146
                                ],
                                [
                                    445.264686854498,
                                    -255.31260212510824
                                ],
                                [
                                    567.1287262705155,
                                    -414.65824346151203
                                ],
                                [
                                    570.4898319427157,
                                    -412.20731523353606
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -3,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    566.0114862072514,
                                    -415.3952153129503
                                ],
                                [
                                    526.3178615267971,
                                    -371.9273846587166
                                ],
                                [
                                    420.9142636442557,
                                    -235.39138147141784
                                ],
                                [
                                    293.12768723414047,
                                    -69.02471667807549
                                ],
                                [
                                    290.07174751145067,
                                    -70.6578523144126
                                ],
                                [
                                    417.9635702712694,
                                    -237.5015376629308
                                ],
                                [
                                    523.348176593252,
                                    -374.3870524233207
                                ],
                                [
                                    562.9411560249864,
                                    -417.51383363083005
                                ],
                                [
                                    566.0114862072514,
                                    -415.3952153129503
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -4,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    560.8794837046298,
                                    -418.56981870532036
                                ],
                                [
                                    523.348176593252,
                                    -374.3870524233207
                                ],
                                [
                                    482.364855578111,
                                    -321.393402970396
                                ],
                                [
                                    417.9635702712694,
                                    -237.5015376629308
                                ],
                                [
                                    400.2264643313829,
                                    -214.5553731545806
                                ],
                                [
                                    358.43832916312385,
                                    -174.91530229430646
                                ],
                                [
                                    314.6819614908309,
                                    -143.90204749349505
                                ],
                                [
                                    311.43236986891134,
                                    -148.65390884503722
                                ],
                                [
                                    354.7595205893158,
                                    -179.08403029013425
                                ],
                                [
                                    395.4013636430609,
                                    -218.46967659518123
                                ],
                                [
                                    414.14003745338414,
                                    -240.33766895905137
                                ],
                                [
                                    479.5424434004235,
                                    -324.3662158176303
                                ],
                                [
                                    520.4895956247346,
                                    -376.65872219670564
                                ],
                                [
                                    557.5267711196211,
                                    -421.4385609002784
                                ],
                                [
                                    560.8794837046298,
                                    -418.56981870532036
                                ]
                            ]
                        ]
                    }
                ]
            ]

            # 将 JSON 数据转换为包含 Polygon 对象的元组列表
            lanes_polygons_19_38 = [
                (index, shape(polygon_dict)) for index, polygon_dict in json_data
            ]            

            # 更新playground19-38的轨迹数据
            input_file_19_38 = f'{index}_tracks.csv'
            output_file_19_38 = f'{index}_updated_tracks.csv'
            #playground19_38.update_track_data(input_file_19_38, output_file_19_38, onramp_polygons_19_38, offramp_polygons_19_38, lanes_polygons_19_38)
            updated_tracks_df = playground19_38.extract_turn_type_and_lane(input_file_19_38, onramp_polygons_19_38, offramp_polygons_19_38, lanes_polygons_19_38)
            #plot_polygons_from_json(json_data, ax)
            # Set labels, title, and other plot parameters
            ax.set_xlabel("X Coordinate")
            ax.set_ylabel("Y Coordinate")
            ax.set_title("Visualization of Polygons from JSON Data")
            ax.legend()
            ax.grid(True)
            ax.axis('equal')

            # Show the plot
            #plt.show()
            
            return json_data, updated_tracks_df

        elif 39 <= index <= 52:
            # 提供的 JSON 数据
            
            json_data = {
                "playground39-52_lane-3_OnRamp": [
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    728.9518131427467,
                                    -303.89075079280883
                                ],
                                [
                                    759.2265630253823,
                                    -260.64898117631674
                                ],
                                [
                                    772.9346081644762,
                                    -231.45304796658456
                                ],
                                [
                                    781.7091981001431,
                                    -198.51846698950976
                                ],
                                [
                                    782.0868422087515,
                                    -172.79553107358515
                                ],
                                [
                                    778.1012791024987,
                                    -171.9681030884385
                                ],
                                [
                                    778.0676012065378,
                                    -197.2596454527229
                                ],
                                [
                                    769.5015542802867,
                                    -229.9336008913815
                                ],
                                [
                                    755.4992944031255,
                                    -258.5593629768118
                                ],
                                [
                                    725.5469827312045,
                                    -302.29101979825646
                                ],
                                [
                                    728.9518131427467,
                                    -303.89075079280883
                                ]
                            ]
                        ]
                    },
                    -3
                ]
            }
            
            
            json_data = {
                "playground39-52_lane-3_OnRamp": [
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [782.1222612997517, -172.8498606113717],
                                [782.5026083147968, -178.69134480692446],
                                [782.6168229026953, -182.76675856206566],
                                [782.6356746800593, -186.3444821285084],
                                [782.45303411223, -190.2901397915557],
                                [782.2163207423291, -193.64626288972795],
                                [781.8543911891757, -197.36354630626738],
                                [781.3954270118847, -200.4830227913335],
                                [780.6511865754728, -204.45978701021522],
                                [779.5915306129027, -209.47435975726694],
                                [778.0313160476508, -215.76891931332648],
                                [776.4265848194482, -221.4235579064116],
                                [774.258756152296, -227.84437528345734],
                                [772.9135472275666, -231.69210642576218],
                                [770.2966497888556, -238.19527731928974],
                                [767.4713930146536, -244.849434601143],
                                [764.9150594008388, -250.1044899141416],
                                [762.4626510685775, -254.67088004667312],
                                [759.2064951825887, -260.6852887608111],
                                [755.7676390000852, -265.71991160232574],
                                [747.7468738880125, -277.156825106591],
                                [742.8855420038453, -284.02875540964305],
                                [736.9311827488709, -292.59759406372905],
                                [732.6241938886815, -298.7508625173941],
                                [728.9959438970545, -303.98218005523086],
                                [725.6131496030139, -302.2807689970359],
                                [730.7502810281003, -294.97203063126653],
                                [735.696821688849, -287.7735174763948],
                                [740.2382362101926, -281.22083054762334],
                                [744.1237098961719, -275.6925163930282],
                                [751.8234960129485, -264.4786714864895],
                                [755.4998903148226, -258.6464850958437],
                                [757.6245280751609, -254.98706994298846],
                                [760.3874334435095, -249.8865613695234],
                                [762.9334704146022, -244.93307005241513],
                                [765.645717394771, -239.15871232468635],
                                [767.7612859553192, -234.23118163272738],
                                [769.5261766476324, -229.88671692553908],
                                [771.4549489876954, -224.5295445714146],
                                [772.8565919987159, -220.24570611584932],
                                [774.1169327963144, -216.2358465027064],
                                [775.4437538646744, -211.27220153529197],
                                [776.5700117580127, -206.29337935801595],
                                [777.4475046878797, -201.84181081224233],
                                [778.1150016022148, -197.1653278619051],
                                [778.6027878751629, -191.90539327915758],
                                [778.859780025552, -186.9598540412262],
                                [778.9411651695846, -182.1447721151635],
                                [778.7981734318892, -178.369138719514],
                                [778.5332422037027, -174.0838318504393],
                                [778.2755174223566, -171.96582826506346],
                                [782.1222612997517, -172.8498606113717]
                            ]
                        ]
                    },
                    -3
                ]
            }
            
            # 将 JSON 数据转换为包含 Polygon 对象的字典
            onramp_polygons_39_52 = {
                key: (shape(polygon_dict), value) for key, (polygon_dict, value) in json_data.items()
            }

            # 提供的 JSON 数据
            json_data = {
                "playground39-52_lane3_OffRamp": [
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    758.7882475814549,
                                    -298.12368457764387
                                ],
                                [
                                    789.6128554748138,
                                    -256.79227890912443
                                ],
                                [
                                    808.6673423104221,
                                    -240.34378073178232
                                ],
                                [
                                    832.2387319568079,
                                    -227.70339542347938
                                ],
                                [
                                    864.34231781587,
                                    -218.31831522099674
                                ],
                                [
                                    864.8554476378486,
                                    -221.93957885261625
                                ],
                                [
                                    834.1090655809967,
                                    -231.06522625125945
                                ],
                                [
                                    811.9765433611465,
                                    -243.47062540706247
                                ],
                                [
                                    792.6502347435453,
                                    -259.39667652361095
                                ],
                                [
                                    762.197262930451,
                                    -299.9399224091321
                                ],
                                [
                                    758.7882475814549,
                                    -298.12368457764387
                                ]
                            ]
                        ]
                    },
                    3
                ]
            }
            
            json_data = {
                "playground39-52_lane3_OffRamp": [
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [758.7725495210616, -298.0472555179149],
                                [764.6143563213991, -289.7391766589135],
                                [769.5384262586012, -282.78165158908814],
                                [773.3706909799948, -277.40493995696306],
                                [776.3273149775341, -273.34961233101785],
                                [780.1230103958515, -267.99432268645614],
                                [783.7346684956574, -263.3760257232934],
                                [787.1276642162702, -259.44226684980094],
                                [789.7116596578853, -256.68940789904445],
                                [793.1920108357444, -253.26562281977385],
                                [797.190301572904, -249.7422150177881],
                                [801.2325739476364, -246.33028458803892],
                                [806.6035249903798, -242.3926746547222],
                                [811.930829697405, -238.90974535886198],
                                [817.8895385207143, -235.20060111396015],
                                [823.9420657755691, -231.79761182982475],
                                [830.387095738668, -228.5967101547867],
                                [834.7047130883439, -226.61882942449301],
                                [841.8142107169842, -224.02392042335123],
                                [848.0347428593086, -221.9815918346867],
                                [853.318858644343, -220.4442184427753],
                                [858.2542585816118, -219.28521340247244],
                                [862.3084037280059, -218.56837892066687],
                                [864.4183694177773, -218.17372157145292],
                                [864.9881818681024, -222.01102772913873],
                                [858.7408566775266, -223.00394513830543],
                                [851.3375116599491, -224.87793168146163],
                                [844.220699349884, -227.1655716318637],
                                [838.6969538164558, -229.16358647868037],
                                [832.2399602013174, -231.8880422981456],
                                [825.3865880933008, -235.27831586264074],
                                [819.2309529659105, -238.76837513037026],
                                [813.5806942965137, -242.33065556641668],
                                [808.4546644857619, -245.91585657931864],
                                [803.0995704546804, -249.90757997706532],
                                [798.5515482592746, -253.7663226686418],
                                [793.7447525950847, -258.1677904315293],
                                [789.9411532664672, -262.2800074154511],
                                [786.4696510211797, -266.3513671644032],
                                [783.184998888988, -270.53280080948025],
                                [779.7347790126223, -275.15244251396507],
                                [776.9411001334083, -279.20711629558355],
                                [773.2505417141365, -284.3315653335303],
                                [768.8398526317906, -290.5497340550646],
                                [765.3002228741534, -295.54787954036146],
                                [762.0766190505237, -300.05540407355875],
                                [758.7725495210616, -298.0472555179149]
                            ]
                        ]
                    },
                    3
                ]
            }
            
            # 将 JSON 数据转换为包含 Polygon 对象的字典
            offramp_polygons_39_52 = {
                key: (shape(polygon_dict), value) for key, (polygon_dict, value) in json_data.items()
            }
           # 提供的 JSON 数据
            
            json_data = [
                [
                    1,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    550.3666555886157,
                                    -613.2468181429431
                                ],
                                [
                                    650.6351881056908,
                                    -446.5388767309487
                                ],
                                [
                                    751.9961593647604,
                                    -294.6560219908133
                                ],
                                [
                                    818.3653080437798,
                                    -202.98225261922926
                                ],
                                [
                                    821.7713480112143,
                                    -204.83774710912257
                                ],
                                [
                                    755.4363849782385,
                                    -296.4591388395056
                                ],
                                [
                                    654.0720736680087,
                                    -448.28273222316056
                                ],
                                [
                                    553.7309505094308,
                                    -615.0203938810155
                                ],
                                [
                                    550.3666555886157,
                                    -613.2468181429431
                                ]
                            ]
                        ]
                    }
                ],
                [
                    2,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    821.7713480112143,
                                    -204.83774710912257
                                ],
                                [
                                    755.4363849782385,
                                    -296.4591388395056
                                ],
                                [
                                    654.0720736680087,
                                    -448.28273222316056
                                ],
                                [
                                    553.7309505094308,
                                    -615.0203938810155
                                ],
                                [
                                    557.1847433248768,
                                    -616.7197587182745
                                ],
                                [
                                    657.6569919321337,
                                    -449.7838460467756
                                ],
                                [
                                    758.7882475814549,
                                    -298.12368457764387
                                ],
                                [
                                    825.0851369101438,
                                    -206.51859422773123
                                ],
                                [
                                    821.7713480112143,
                                    -204.83774710912257
                                ]
                            ]
                        ]
                    }
                ],
                [
                    3,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    657.6569919321337,
                                    -449.7838460467756
                                ],
                                [
                                    758.7882475814549,
                                    -298.12368457764387
                                ],
                                [
                                    789.6128554748138,
                                    -256.79227890912443
                                ],
                                [
                                    808.6673423104221,
                                    -240.34378073178232
                                ],
                                [
                                    832.2387319568079,
                                    -227.70339542347938
                                ],
                                [
                                    864.34231781587,
                                    -218.31831522099674
                                ],
                                [
                                    864.8554476378486,
                                    -221.93957885261625
                                ],
                                [
                                    834.1090655809967,
                                    -231.06522625125945
                                ],
                                [
                                    811.9765433611465,
                                    -243.47062540706247
                                ],
                                [
                                    792.6502347435453,
                                    -259.39667652361095
                                ],
                                [
                                    762.197262930451,
                                    -299.9399224091321
                                ],
                                [
                                    679.3283944293507,
                                    -422.59100539330393
                                ],
                                [
                                    671.4714580529835,
                                    -433.7532955799252
                                ],
                                [
                                    657.6569919321337,
                                    -449.7838460467756
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -1,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    545.002065553097,
                                    -610.8200022112578
                                ],
                                [
                                    645.6008328213356,
                                    -443.5356948794797
                                ],
                                [
                                    746.8890539419372,
                                    -291.889259560965
                                ],
                                [
                                    813.5014277292648,
                                    -199.74753678496927
                                ],
                                [
                                    810.121714251989,
                                    -197.84799278341234
                                ],
                                [
                                    743.6359536906821,
                                    -290.082047409378
                                ],
                                [
                                    641.9355473061441,
                                    -441.9713333239779
                                ],
                                [
                                    541.5157484423835,
                                    -609.2880500555038
                                ],
                                [
                                    545.002065553097,
                                    -610.8200022112578
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -2,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    541.5157484423835,
                                    -609.2880500555038
                                ],
                                [
                                    641.9355473061441,
                                    -441.9713333239779
                                ],
                                [
                                    743.6359536906821,
                                    -290.082047409378
                                ],
                                [
                                    810.121714251989,
                                    -197.84799278341234
                                ],
                                [
                                    806.7676769854152,
                                    -195.76804823800921
                                ],
                                [
                                    740.0616079965839,
                                    -288.1973986700177
                                ],
                                [
                                    638.6830915680621,
                                    -440.420826215297
                                ],
                                [
                                    621.4728849959793,
                                    -466.8916496504098
                                ],
                                [
                                    537.9852168856887,
                                    -607.4726453796029
                                ],
                                [
                                    541.5157484423835,
                                    -609.2880500555038
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -3,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    621.4728849959793,
                                    -466.8916496504098
                                ],
                                [
                                    638.6830915680621,
                                    -440.420826215297
                                ],
                                [
                                    740.0616079965839,
                                    -288.1973986700177
                                ],
                                [
                                    759.2265630253823,
                                    -260.64898117631674
                                ],
                                [
                                    772.9346081644762,
                                    -231.45304796658456
                                ],
                                [
                                    781.7091981001431,
                                    -198.51846698950976
                                ],
                                [
                                    782.0868422087515,
                                    -172.79553107358515
                                ],
                                [
                                    778.1012791024987,
                                    -171.9681030884385
                                ],
                                [
                                    778.0676012065378,
                                    -197.2596454527229
                                ],
                                [
                                    769.5015542802867,
                                    -229.9336008913815
                                ],
                                [
                                    755.4992944031255,
                                    -258.5593629768118
                                ],
                                [
                                    736.6671986082802,
                                    -286.3566905800253
                                ],
                                [
                                    642.3361816246179,
                                    -427.91532318573445
                                ],
                                [
                                    621.4728849959793,
                                    -466.8916496504098
                                ]
                            ]
                        ]
                    }
                ]
            ]
                   
            json_data = [
                [
                    1,
            {
            "type": "Polygon",
            "coordinates": [
                [
                    [
                        818.3156648934819,
                        -202.99224422872066
                    ],
                    [
                        814.366656491824,
                        -208.4991778349504
                    ],
                    [
                        807.8110336668906,
                        -217.28255614638329
                    ],
                    [
                        804.3012605601107,
                        -221.99268290679902
                    ],
                    [
                        800.1450622292468,
                        -227.6884644627571
                    ],
                    [
                        796.6467709874269,
                        -232.64631877746433
                    ],
                    [
                        793.4945319257095,
                        -236.78703692089766
                    ],
                    [
                        789.1279214442475,
                        -242.68165744002908
                    ],
                    [
                        785.6487262296723,
                        -247.61639210302383
                    ],
                    [
                        782.3179461586988,
                        -252.16641175746918
                    ],
                    [
                        777.3621021327563,
                        -258.95759945642203
                    ],
                    [
                        772.7465806479449,
                        -265.42020054440945
                    ],
                    [
                        768.203063170542,
                        -271.76639827061445
                    ],
                    [
                        763.7976269229548,
                        -278.03740322589874
                    ],
                    [
                        758.9618185770232,
                        -284.6899343300611
                    ],
                    [
                        754.5765775119653,
                        -290.9871093221009
                    ],
                    [
                        751.4579709904501,
                        -295.4007500577718
                    ],
                    [
                        746.2241023213719,
                        -303.0372612597421
                    ],
                    [
                        741.9311029670062,
                        -309.12934002187103
                    ],
                    [
                        737.4992317915894,
                        -315.3943945337087
                    ],
                    [
                        733.6217854568968,
                        -321.23369670379907
                    ],
                    [
                        730.0302215342526,
                        -326.4219247754663
                    ],
                    [
                        726.366163969331,
                        -331.56998665165156
                    ],
                    [
                        723.2637277925387,
                        -336.3972076047212
                    ],
                    [
                        720.1329150564852,
                        -341.0136929024011
                    ],
                    [
                        716.284240699315,
                        -346.5235477536917
                    ],
                    [
                        711.8697402671678,
                        -353.15660313423723
                    ],
                    [
                        706.2466336129,
                        -361.54256208240986
                    ],
                    [
                        701.3862048772862,
                        -368.9200879810378
                    ],
                    [
                        694.0928335204953,
                        -379.87618201225996
                    ],
                    [
                        687.8068666476756,
                        -389.36590712238103
                    ],
                    [
                        681.4308005661005,
                        -399.0876315413043
                    ],
                    [
                        675.9980667472701,
                        -407.1450338298455
                    ],
                    [
                        671.6242690281942,
                        -413.984853990376
                    ],
                    [
                        667.1537549799541,
                        -420.9097967958078
                    ],
                    [
                        662.8574751028791,
                        -427.5442258073017
                    ],
                    [
                        659.1304602493765,
                        -433.1658995328471
                    ],
                    [
                        655.5086634120671,
                        -438.90582752786577
                    ],
                    [
                        652.8994166094344,
                        -442.95210507232696
                    ],
                    [
                        650.6278112208238,
                        -446.44013032503426
                    ],
                    [
                        654.0936303077033,
                        -448.2158776987344
                    ],
                    [
                        658.6461701756343,
                        -441.1509276069701
                    ],
                    [
                        665.2189153536456,
                        -430.864226651378
                    ],
                    [
                        668.3166993202758,
                        -425.9357844879851
                    ],
                    [
                        674.8844450023025,
                        -416.00264185108244
                    ],
                    [
                        678.2357665192103,
                        -410.97842633817345
                    ],
                    [
                        684.7603374138707,
                        -400.9546524193138
                    ],
                    [
                        687.9928244674811,
                        -395.97960253152996
                    ],
                    [
                        694.6658107930562,
                        -386.0179834626615
                    ],
                    [
                        698.0113458150299,
                        -381.00627186056226
                    ],
                    [
                        704.5997841414064,
                        -371.1630109278485
                    ],
                    [
                        707.8133611408994,
                        -365.96190832648426
                    ],
                    [
                        714.47403755493,
                        -356.0643536122516
                    ],
                    [
                        717.8954740207992,
                        -350.9894390758127
                    ],
                    [
                        724.4779093117686,
                        -341.27738119103014
                    ],
                    [
                        727.8259887194727,
                        -336.1542120631784
                    ],
                    [
                        734.6339778651018,
                        -326.351781796664
                    ],
                    [
                        737.9354241102701,
                        -321.35137609019876
                    ],
                    [
                        744.8223298420198,
                        -311.72277461830527
                    ],
                    [
                        748.3337349012727,
                        -306.6112454487011
                    ],
                    [
                        755.0363899554359,
                        -296.979575490579
                    ],
                    [
                        758.5538003401598,
                        -291.99663194827735
                    ],
                    [
                        765.4359866050654,
                        -282.2237187558785
                    ],
                    [
                        769.024517893442,
                        -277.1912770373747
                    ],
                    [
                        775.7564474707469,
                        -267.6775609878823
                    ],
                    [
                        779.2592630299041,
                        -262.7082283431664
                    ],
                    [
                        786.2806271312875,
                        -253.06238992605358
                    ],
                    [
                        789.8327558746096,
                        -248.2805971680209
                    ],
                    [
                        796.7655948018073,
                        -238.7104799747467
                    ],
                    [
                        800.3344648465281,
                        -233.75652779079974
                    ],
                    [
                        807.5099447411485,
                        -224.20994985010475
                    ],
                    [
                        811.0046517836745,
                        -219.24263776931912
                    ],
                    [
                        818.138350246998,
                        -209.6880280673504
                    ],
                    [
                        821.6433817181969,
                        -204.82243660837412
                    ],
                    [
                        818.3156648934819,
                        -202.99224422872066
                    ]
                ]
            ]
        }
    ],
    [
        2,
        {
            "type": "Polygon",
            "coordinates": [
                [
                    [
                        821.7772725818213,
                        -204.77090392820537
                    ],
                    [
                        818.0803336098325,
                        -209.69160665851086
                    ],
                    [
                        811.1808070714469,
                        -219.34737880714238
                    ],
                    [
                        807.5542467810446,
                        -223.9448605608195
                    ],
                    [
                        800.4661983292317,
                        -233.86016129236668
                    ],
                    [
                        796.9486671233317,
                        -238.68250444158912
                    ],
                    [
                        789.8594021559693,
                        -248.43863965943456
                    ],
                    [
                        786.3513061042177,
                        -253.17209360096604
                    ],
                    [
                        779.3757292022929,
                        -262.79310116916895
                    ],
                    [
                        775.9206817499362,
                        -267.7381683671847
                    ],
                    [
                        768.8963675984996,
                        -277.33282471168786
                    ],
                    [
                        765.3255885454128,
                        -282.3210017811507
                    ],
                    [
                        758.5580496292678,
                        -291.91212678328156
                    ],
                    [
                        755.0902262266027,
                        -296.90167616680264
                    ],
                    [
                        748.2540785903111,
                        -306.68363339919597
                    ],
                    [
                        744.8246696559945,
                        -311.69923597946763
                    ],
                    [
                        738.1153727779165,
                        -321.3193369517103
                    ],
                    [
                        734.616377492086,
                        -326.4625792708248
                    ],
                    [
                        727.9882207812043,
                        -336.16085916850716
                    ],
                    [
                        724.5958958442789,
                        -341.28444204106927
                    ],
                    [
                        717.9642848917283,
                        -351.067797482945
                    ],
                    [
                        714.4851291217492,
                        -356.1058641113341
                    ],
                    [
                        707.9691591637093,
                        -366.0052239764482
                    ],
                    [
                        704.5495106065064,
                        -371.0184604022652
                    ],
                    [
                        697.956259708968,
                        -380.93606238346547
                    ],
                    [
                        694.6306073755259,
                        -386.0141401691362
                    ],
                    [
                        688.175325720571,
                        -395.8175427792594
                    ],
                    [
                        684.7996125551872,
                        -400.7822274779901
                    ],
                    [
                        678.2665626092348,
                        -411.0025909272954
                    ],
                    [
                        674.8660132133518,
                        -415.9529091520235
                    ],
                    [
                        668.4586356349755,
                        -425.9710114663467
                    ],
                    [
                        665.25191894616,
                        -430.93574849143624
                    ],
                    [
                        658.7536073375959,
                        -440.9026603009552
                    ],
                    [
                        655.6012970220763,
                        -445.94448820129037
                    ],
                    [
                        649.133575590211,
                        -456.2254426414147
                    ],
                    [
                        645.9841393573442,
                        -461.283277425915
                    ],
                    [
                        639.5472629349679,
                        -471.3297169925645
                    ],
                    [
                        636.3248004342313,
                        -476.5089483233169
                    ],
                    [
                        629.9623610595008,
                        -486.62326559703797
                    ],
                    [
                        626.8264959147782,
                        -491.7228604145348
                    ],
                    [
                        620.5948328363011,
                        -501.776651494205
                    ],
                    [
                        617.3803394975839,
                        -506.96319433674216
                    ],
                    [
                        611.2064524750458,
                        -517.1982044037431
                    ],
                    [
                        608.2261426668847,
                        -522.2377081857994
                    ],
                    [
                        601.9400747718173,
                        -532.3640456357971
                    ],
                    [
                        598.9425118605723,
                        -537.7272942876443
                    ],
                    [
                        592.8061663642293,
                        -547.8418484246358
                    ],
                    [
                        589.7441378358053,
                        -553.0453208358958
                    ],
                    [
                        583.7519838308217,
                        -563.2362589593977
                    ],
                    [
                        580.5994836156024,
                        -568.4869980709627
                    ],
                    [
                        574.5600068873027,
                        -578.8119120318443
                    ],
                    [
                        571.4288108944893,
                        -584.0024750102311
                    ],
                    [
                        565.4752489902312,
                        -594.3671668544412
                    ],
                    [
                        562.4907465366414,
                        -599.7964656082913
                    ],
                    [
                        556.602100454329,
                        -609.9713373640552
                    ],
                    [
                        553.6050556460395,
                        -615.0188218774274
                    ],
                    [
                        557.1109504026826,
                        -616.5877021523193
                    ],
                    [
                        559.9426878725644,
                        -612.0319563187659
                    ],
                    [
                        565.8642947499757,
                        -601.6833260739222
                    ],
                    [
                        568.8844069081824,
                        -596.3599763764068
                    ],
                    [
                        574.8670172156417,
                        -586.0398273682222
                    ],
                    [
                        577.8745796814328,
                        -580.8320270041004
                    ],
                    [
                        583.9322871367331,
                        -570.4222046537325
                    ],
                    [
                        586.9957060674205,
                        -565.3623669752851
                    ],
                    [
                        593.1437913456466,
                        -555.0999644976109
                    ],
                    [
                        596.2048277602298,
                        -549.8857807293534
                    ],
                    [
                        602.2956743850373,
                        -539.710623244755
                    ],
                    [
                        605.3448626662139,
                        -534.5562149416655
                    ],
                    [
                        611.5518140766071,
                        -524.0575057277456
                    ],
                    [
                        614.4720471721375,
                        -519.2963780770078
                    ],
                    [
                        620.6763659313438,
                        -508.96704255975783
                    ],
                    [
                        623.6390509470366,
                        -503.83317956514657
                    ],
                    [
                        630.0710834845668,
                        -493.4051037868485
                    ],
                    [
                        633.131635738886,
                        -488.5398834971711
                    ],
                    [
                        639.4604133359389,
                        -478.3583782669157
                    ],
                    [
                        642.7442855625413,
                        -473.0690473066643
                    ],
                    [
                        648.9627896965249,
                        -463.2600061688572
                    ],
                    [
                        651.9841268422315,
                        -458.32317411433905
                    ],
                    [
                        657.5062546028057,
                        -449.81818355526775
                    ],
                    [
                        662.3087428816361,
                        -442.1841722782701
                    ],
                    [
                        665.8096687585348,
                        -436.8906904058531
                    ],
                    [
                        668.9178122501471,
                        -432.0419278014451
                    ],
                    [
                        672.2128706321237,
                        -426.996648915112
                    ],
                    [
                        675.3005814226344,
                        -422.026093557477
                    ],
                    [
                        678.6970199481584,
                        -416.9183233808726
                    ],
                    [
                        681.9271009481745,
                        -412.0760811464861
                    ],
                    [
                        685.139996028156,
                        -406.9262545676902
                    ],
                    [
                        688.2484805357526,
                        -401.9978731861338
                    ],
                    [
                        691.6966604040936,
                        -396.9079085942358
                    ],
                    [
                        694.8964050275972,
                        -392.15075431391597
                    ],
                    [
                        698.4159240042209,
                        -386.88289772346616
                    ],
                    [
                        701.4881623578258,
                        -382.16567729692906
                    ],
                    [
                        704.9207834915724,
                        -376.988956598565
                    ],
                    [
                        708.0664181797765,
                        -372.1974793402478
                    ],
                    [
                        711.5843698800309,
                        -367.0832503270358
                    ],
                    [
                        714.782210599049,
                        -362.22468013036996
                    ],
                    [
                        718.1349930241122,
                        -357.30464739445597
                    ],
                    [
                        721.3724341115449,
                        -352.3534828033298
                    ],
                    [
                        724.9649666388286,
                        -347.27438347041607
                    ],
                    [
                        727.976822622004,
                        -342.51851268764585
                    ],
                    [
                        731.5378873259178,
                        -337.4503679443151
                    ],
                    [
                        734.9897209027549,
                        -332.47064501512796
                    ],
                    [
                        738.3232548668748,
                        -327.53241335134953
                    ],
                    [
                        741.6740086710779,
                        -322.7248127358034
                    ],
                    [
                        745.1807647255482,
                        -317.61056890990585
                    ],
                    [
                        748.4880942499731,
                        -312.87242072448134
                    ],
                    [
                        752.0064504191978,
                        -307.84476004354656
                    ],
                    [
                        755.2456387302373,
                        -303.02941143885255
                    ],
                    [
                        758.8467698179302,
                        -297.97880301158875
                    ],
                    [
                        761.6723184582079,
                        -293.7695095259696
                    ],
                    [
                        768.6011313903145,
                        -284.2505495781079
                    ],
                    [
                        771.8579685894074,
                        -279.39565146062523
                    ],
                    [
                        778.9382174967322,
                        -269.58228795416653
                    ],
                    [
                        782.4856571934652,
                        -264.6711961114779
                    ],
                    [
                        789.3600790152559,
                        -255.178490226157
                    ],
                    [
                        792.7203359272098,
                        -250.63717189058661
                    ],
                    [
                        799.7522853990085,
                        -240.82086683623493
                    ],
                    [
                        803.3889629334444,
                        -235.9325708374381
                    ],
                    [
                        821.2675583696691,
                        -211.69878406543285
                    ],
                    [
                        825.1003900102805,
                        -206.55715164914727
                    ],
                    [
                        821.7772725818213,
                        -204.77090392820537
                    ]
                ]
            ]
        }
    ],
        [
        3,
        {
            "type": "Polygon",
            "coordinates": [
                [
                    [
                        657.6383567112498,
                        -449.7992981383577
                    ],
                    [
                        662.2746532848105,
                        -442.13843803387135
                    ],
                    [
                        665.7113050367916,
                        -436.9307128181681
                    ],
                    [
                        668.812797396793,
                        -432.16632497217506
                    ],
                    [
                        672.1788943824358,
                        -427.0703361565247
                    ],
                    [
                        675.3900051255478,
                        -422.083834156394
                    ],
                    [
                        678.5962370513007,
                        -417.07380776293576
                    ],
                    [
                        681.9216490717372,
                        -412.09989748708904
                    ],
                    [
                        685.2322949094232,
                        -407.02500939834863
                    ],
                    [
                        688.4688400867162,
                        -402.1436884654686
                    ],
                    [
                        691.7772907309118,
                        -396.9488063938916
                    ],
                    [
                        695.0085962587036,
                        -392.0644853655249
                    ],
                    [
                        698.3562913495116,
                        -386.98470690567046
                    ],
                    [
                        701.5049293660559,
                        -382.2761453650892
                    ],
                    [
                        705.0250566671602,
                        -377.0693659549579
                    ],
                    [
                        708.1836523261154,
                        -372.3451695898548
                    ],
                    [
                        711.498986626626,
                        -367.18082749284804
                    ],
                    [
                        714.8970848914469,
                        -362.2811867315322
                    ],
                    [
                        718.1544869479258,
                        -357.2688259873539
                    ],
                    [
                        721.415686635708,
                        -352.449502020143
                    ],
                    [
                        724.96086817584,
                        -347.4024775624275
                    ],
                    [
                        727.9860543800169,
                        -342.44638316053897
                    ],
                    [
                        731.6047395995702,
                        -337.1834888579324
                    ],
                    [
                        734.8432782555465,
                        -332.65949576627463
                    ],
                    [
                        738.3430119116092,
                        -327.5072019174695
                    ],
                    [
                        741.5803753366927,
                        -322.8510973928496
                    ],
                    [
                        745.1072775770444,
                        -317.8046131450683
                    ],
                    [
                        748.3878230887931,
                        -312.8660931410268
                    ],
                    [
                        752.0154584848206,
                        -307.93292066827416
                    ],
                    [
                        755.2322503297473,
                        -303.127460218966
                    ],
                    [
                        758.7819337947294,
                        -297.9016305943951
                    ],
                    [
                        761.8694022896234,
                        -293.56463041808456
                    ],
                    [
                        768.7253348637023,
                        -283.86719663254917
                    ],
                    [
                        772.6927198490012,
                        -278.3778445729986
                    ],
                    [
                        779.1791386266705,
                        -269.23769597895443
                    ],
                    [
                        783.0619243659312,
                        -264.2073675682768
                    ],
                    [
                        785.6140931232367,
                        -261.3111225804314
                    ],
                    [
                        788.9282028175658,
                        -257.5820418559015
                    ],
                    [
                        792.6368850322324,
                        -253.90459955204278
                    ],
                    [
                        796.5237021489302,
                        -250.20582552999258
                    ],
                    [
                        801.1784277582192,
                        -246.33081308472902
                    ],
                    [
                        805.3090098293615,
                        -243.1410039961338
                    ],
                    [
                        809.2579917259282,
                        -240.45694918837398
                    ],
                    [
                        813.6815728353104,
                        -237.8988100029528
                    ],
                    [
                        818.5543506084359,
                        -234.6047808304429
                    ],
                    [
                        823.7424784018076,
                        -231.7873518979177
                    ],
                    [
                        827.961215330055,
                        -229.61150253657252
                    ],
                    [
                        831.1109729249729,
                        -228.48692759405822
                    ],
                    [
                        832.3402278234717,
                        -227.7188511164859
                    ],
                    [
                        836.8947448759573,
                        -225.7196649769321
                    ],
                    [
                        841.7026092250017,
                        -224.10210717655718
                    ],
                    [
                        845.9673959063366,
                        -222.58525776863098
                    ],
                    [
                        850.5297456150874,
                        -221.15458063222468
                    ],
                    [
                        858.3495955299004,
                        -219.34136381186545
                    ],
                    [
                        864.2755264880252,
                        -218.23758690897375
                    ],
                    [
                        865.0071174069308,
                        -222.0779086239636
                    ],
                    [
                        858.6263867029338,
                        -223.05786129739136
                    ],
                    [
                        851.1265228220727,
                        -224.9229072937742
                    ],
                    [
                        846.7982319578296,
                        -226.233642347157
                    ],
                    [
                        842.6205351009849,
                        -227.7299792142585
                    ],
                    [
                        837.7761352567468,
                        -229.58086451794952
                    ],
                    [
                        834.2618211051449,
                        -231.20436489302665
                    ],
                    [
                        829.412172667915,
                        -233.12285099551082
                    ],
                    [
                        824.830171530717,
                        -235.31511846650392
                    ],
                    [
                        819.6806616640533,
                        -238.54127334430814
                    ],
                    [
                        813.1489312922349,
                        -242.63982817530632
                    ],
                    [
                        808.195975216222,
                        -246.0402266131714
                    ],
                    [
                        803.397958066198,
                        -249.7168518230319
                    ],
                    [
                        799.0385407542344,
                        -253.33683308586478
                    ],
                    [
                        794.8705127827707,
                        -257.26359525695443
                    ],
                    [
                        791.9746379832504,
                        -260.14382183458656
                    ],
                    [
                        789.0306559628807,
                        -263.4924676194787
                    ],
                    [
                        785.9813419024576,
                        -266.8973512323573
                    ],
                    [
                        782.7187493059319,
                        -271.15685385186225
                    ],
                    [
                        779.9458714443608,
                        -274.9860225068405
                    ],
                    [
                        776.2452756067505,
                        -280.08684568386525
                    ],
                    [
                        772.313639112399,
                        -285.77341581042856
                    ],
                    [
                        765.2727749121841,
                        -295.45013347361237
                    ],
                    [
                        762.1860639657243,
                        -299.88197792414576
                    ],
                    [
                        758.6354797430104,
                        -305.0191195718944
                    ],
                    [
                        755.4343535790686,
                        -309.42376185860485
                    ],
                    [
                        751.7994040194899,
                        -314.7034533666447
                    ],
                    [
                        748.5472509374376,
                        -319.22881658189
                    ],
                    [
                        744.8999078333727,
                        -324.4827874302864
                    ],
                    [
                        741.6012851712294,
                        -329.17874156683683
                    ],
                    [
                        739.7850125959958,
                        -332.17215098720044
                    ],
                    [
                        733.1215991958161,
                        -341.5294721610844
                    ],
                    [
                        733.0386484888149,
                        -341.63134766183794
                    ],
                    [
                        724.1906533922302,
                        -354.64535097032785
                    ],
                    [
                        721.1616320394096,
                        -359.23959524184465
                    ],
                    [
                        717.6804248143453,
                        -364.3892566645518
                    ],
                    [
                        714.4748786280397,
                        -369.0551373073831
                    ],
                    [
                        711.1018521888182,
                        -374.2033740580082
                    ],
                    [
                        707.7099978426122,
                        -379.1496697962284
                    ],
                    [
                        704.2665124329505,
                        -384.4588324204087
                    ],
                    [
                        701.2586641711532,
                        -388.8865264384076
                    ],
                    [
                        697.849468231725,
                        -394.10907191596925
                    ],
                    [
                        694.7347680260427,
                        -398.8370247380808
                    ],
                    [
                        691.2630989855388,
                        -404.0442388029769
                    ],
                    [
                        688.1905209131073,
                        -408.82461306545883
                    ],
                    [
                        684.9221962997108,
                        -413.92857599817216
                    ],
                    [
                        681.8483824353316,
                        -418.8093502558768
                    ],
                    [
                        679.3547177612782,
                        -422.67056364100426
                    ],
                    [
                        678.2336569991894,
                        -424.41850097849965
                    ],
                    [
                        676.1360885880422,
                        -427.3676723567769
                    ],
                    [
                        673.4698926089332,
                        -431.18536872044206
                    ],
                    [
                        670.6796915063169,
                        -434.71858209278435
                    ],
                    [
                        667.8778588849818,
                        -438.03718719352037
                    ],
                    [
                        665.0602448193822,
                        -441.3355953898281
                    ],
                    [
                        661.6808891401743,
                        -445.20097507722676
                    ],
                    [
                        659.7791640532669,
                        -447.20598487649113
                    ],
                    [
                        658.7497526960215,
                        -448.5746770426631
                    ],
                    [
                        657.6383567112498,
                        -449.7992981383577
                    ]
                ]
            ]
        }
    ],
    [
        -1,
        {
            "type": "Polygon",
            "coordinates": [
                [
                    [
                        813.2258475872804,
                        -200.04192135483027
                    ],
                    [
                        808.526972100779,
                        -206.36793045606464
                    ],
                    [
                        802.1670070397668,
                        -214.90668565779924
                    ],
                    [
                        794.7249194607721,
                        -225.1398937087506
                    ],
                    [
                        790.6488108664053,
                        -230.62975035887212
                    ],
                    [
                        784.6356235641288,
                        -238.93960932642221
                    ],
                    [
                        777.8193096948089,
                        -248.3720004176721
                    ],
                    [
                        774.1025259395828,
                        -253.52398935332894
                    ],
                    [
                        768.7608035255689,
                        -260.9340563034639
                    ],
                    [
                        763.5903119885479,
                        -268.2077159974724
                    ],
                    [
                        758.095303545997,
                        -275.9281148882583
                    ],
                    [
                        753.4829667455051,
                        -282.5189063800499
                    ],
                    [
                        746.7483854599996,
                        -292.07211520988494
                    ],
                    [
                        739.6429375255248,
                        -302.220242343843
                    ],
                    [
                        733.0836003223667,
                        -311.66477973293513
                    ],
                    [
                        725.0727219530381,
                        -323.2699627671391
                    ],
                    [
                        719.3534275923157,
                        -331.55869630444795
                    ],
                    [
                        712.9685452255071,
                        -340.91275642067194
                    ],
                    [
                        707.0129843001487,
                        -349.75669007282704
                    ],
                    [
                        701.6542305030162,
                        -357.685722514987
                    ],
                    [
                        696.4090059298906,
                        -365.48940240591764
                    ],
                    [
                        691.1749734593905,
                        -373.3531779013574
                    ],
                    [
                        684.749659393332,
                        -383.093605812639
                    ],
                    [
                        677.7816880590399,
                        -393.6532202139497
                    ],
                    [
                        672.7806591432891,
                        -401.34239875432104
                    ],
                    [
                        665.9350142320618,
                        -411.7858381634578
                    ],
                    [
                        660.9228833259549,
                        -419.57158911880106
                    ],
                    [
                        655.0324108867208,
                        -428.6635678904131
                    ],
                    [
                        651.3641377167078,
                        -434.5450426200405
                    ],
                    [
                        647.9812667766819,
                        -439.748212210834
                    ],
                    [
                        645.5359550614376,
                        -443.5870700851083
                    ],
                    [
                        640.6697463076562,
                        -451.2199341962114
                    ],
                    [
                        635.0589179333183,
                        -460.11521718651056
                    ],
                    [
                        625.7929076921428,
                        -474.9923297986388
                    ],
                    [
                        616.7759475696366,
                        -489.49908087961376
                    ],
                    [
                        609.3426199139794,
                        -501.6531878830865
                    ],
                    [
                        603.7738498784602,
                        -510.77958917897195
                    ],
                    [
                        598.1188073587837,
                        -520.1389905745164
                    ],
                    [
                        592.6473575548152,
                        -529.232763058506
                    ],
                    [
                        585.6829346019076,
                        -540.8061744403094
                    ],
                    [
                        579.6508584340336,
                        -550.9429088132456
                    ],
                    [
                        573.9233294065343,
                        -560.7831079922616
                    ],
                    [
                        567.3636914214003,
                        -571.9846871467307
                    ],
                    [
                        560.239975690376,
                        -584.170607060194
                    ],
                    [
                        553.7737509789877,
                        -595.5020373575389
                    ],
                    [
                        547.4772688869853,
                        -606.2926047416404
                    ],
                    [
                        544.9572694578674,
                        -610.8708642395213
                    ],
                    [
                        541.4295983779011,
                        -609.2894267272204
                    ],
                    [
                        545.2114461878082,
                        -602.6066891504452
                    ],
                    [
                        548.100403312943,
                        -597.434781294316
                    ],
                    [
                        554.1213654481107,
                        -587.1274849874899
                    ],
                    [
                        563.0660821779165,
                        -571.662569148466
                    ],
                    [
                        572.157126331178,
                        -556.1606234284118
                    ],
                    [
                        581.3434696611366,
                        -540.6894841743633
                    ],
                    [
                        590.5294429960195,
                        -525.292147019878
                    ],
                    [
                        599.7655126984464,
                        -510.0517578711733
                    ],
                    [
                        609.0905911165755,
                        -494.6977925039828
                    ],
                    [
                        618.4755990357371,
                        -479.4099435713142
                    ],
                    [
                        627.990843706415,
                        -464.17022231500596
                    ],
                    [
                        637.5461066699354,
                        -449.0670269811526
                    ],
                    [
                        647.1414055745117,
                        -433.8652142798528
                    ],
                    [
                        656.6555860262015,
                        -418.8719519590959
                    ],
                    [
                        659.9095239622984,
                        -413.8650095202029
                    ],
                    [
                        666.5222188227344,
                        -403.7916249362752
                    ],
                    [
                        669.7071144601214,
                        -398.653281965293
                    ],
                    [
                        676.351740097627,
                        -388.81839817296714
                    ],
                    [
                        686.1921101449989,
                        -373.9683437794447
                    ],
                    [
                        689.5072815951426,
                        -368.840194045566
                    ],
                    [
                        696.1085112371948,
                        -359.0353048723191
                    ],
                    [
                        706.165803534037,
                        -344.08773766458035
                    ],
                    [
                        716.2186170348432,
                        -329.3953921748325
                    ],
                    [
                        726.4018417007755,
                        -314.51846635714173
                    ],
                    [
                        736.5791641733376,
                        -299.9350130427629
                    ],
                    [
                        740.0127331580734,
                        -295.01020115893334
                    ],
                    [
                        746.8429401435424,
                        -285.2230824576691
                    ],
                    [
                        750.2149185361341,
                        -280.42484691925347
                    ],
                    [
                        757.1859084952157,
                        -270.5691964942962
                    ],
                    [
                        760.5549852817785,
                        -265.73131998907775
                    ],
                    [
                        767.5310684307478,
                        -256.0093228779733
                    ],
                    [
                        770.9466878371313,
                        -251.1643476644531
                    ],
                    [
                        778.0398847750621,
                        -241.53727967012674
                    ],
                    [
                        781.4497392222984,
                        -236.7189365522936
                    ],
                    [
                        788.5258001254988,
                        -227.1186982570216
                    ],
                    [
                        791.9818770504789,
                        -222.2752548865974
                    ],
                    [
                        799.0764193971991,
                        -212.6637785062194
                    ],
                    [
                        802.5655533290701,
                        -207.85086872335523
                    ],
                    [
                        810.0731884291745,
                        -197.8322032270953
                    ],
                    [
                        813.2258475872804,
                        -200.04192135483027
                    ]
                ]
            ]
        }
    ],
    [
        -2,
        {
            "type": "Polygon",
            "coordinates": [
                [
                    [
                        810.081692371401,
                        -197.85239475686103
                    ],
                    [
                        802.5787189363618,
                        -207.9038706291467
                    ],
                    [
                        799.0963888764381,
                        -212.72869472391903
                    ],
                    [
                        791.9289854642702,
                        -222.3164191916585
                    ],
                    [
                        788.5172787463525,
                        -227.06649565510452
                    ],
                    [
                        781.5361066251062,
                        -236.6914799567312
                    ],
                    [
                        778.0459429714247,
                        -241.4948887322098
                    ],
                    [
                        770.9565427410416,
                        -251.21843453589827
                    ],
                    [
                        767.5406692426768,
                        -255.97935145813972
                    ],
                    [
                        760.5310968884733,
                        -265.7065945919603
                    ],
                    [
                        757.176042051171,
                        -270.56767408922315
                    ],
                    [
                        750.1709306518314,
                        -280.4866264676675
                    ],
                    [
                        746.8746984872851,
                        -285.2117493497208
                    ],
                    [
                        740.0527279181988,
                        -294.8903369931504
                    ],
                    [
                        736.6057083812775,
                        -299.89130684453994
                    ],
                    [
                        729.7723707713885,
                        -309.667841126211
                    ],
                    [
                        726.4398712783586,
                        -314.53465096186846
                    ],
                    [
                        719.5758871372091,
                        -324.49679339583963
                    ],
                    [
                        716.1747440948384,
                        -329.44502840563655
                    ],
                    [
                        709.4175051815109,
                        -339.2947137011215
                    ],
                    [
                        706.1596517520957,
                        -344.1756375702098
                    ],
                    [
                        699.4320675514755,
                        -354.0244421483949
                    ],
                    [
                        696.0843586174888,
                        -359.04824501555413
                    ],
                    [
                        689.4196870326996,
                        -369.09671797044575
                    ],
                    [
                        679.5782911765855,
                        -383.9847254762426
                    ],
                    [
                        676.3466057446785,
                        -388.85689887963235
                    ],
                    [
                        669.8423153880285,
                        -398.78962340950966
                    ],
                    [
                        666.5472655937774,
                        -403.8604341382161
                    ],
                    [
                        659.9508020119392,
                        -413.8875987417996
                    ],
                    [
                        656.7533301148214,
                        -418.89622699748725
                    ],
                    [
                        650.3031860878109,
                        -428.96576694585383
                    ],
                    [
                        647.0856706544291,
                        -433.9922720436007
                    ],
                    [
                        640.6174959309283,
                        -444.1085322611034
                    ],
                    [
                        637.4431366038625,
                        -449.06390885822475
                    ],
                    [
                        631.0937128559453,
                        -459.1691262656823
                    ],
                    [
                        627.8858112323214,
                        -464.22453955654055
                    ],
                    [
                        621.5417551731807,
                        -474.380238247104
                    ],
                    [
                        618.4217227457557,
                        -479.5023823417723
                    ],
                    [
                        612.2018871848704,
                        -489.61400223709643
                    ],
                    [
                        602.8051058406709,
                        -505.03080693725497
                    ],
                    [
                        593.4532656879164,
                        -520.3636168213561
                    ],
                    [
                        584.3158799106022,
                        -535.6386597622186
                    ],
                    [
                        575.0913418751443,
                        -551.2107380069792
                    ],
                    [
                        566.0323909533909,
                        -566.6179313585162
                    ],
                    [
                        557.07174430124,
                        -581.9809897746891
                    ],
                    [
                        548.0220187549712,
                        -597.6253060596064
                    ],
                    [
                        541.4814843470813,
                        -609.3143656048924
                    ],
                    [
                        537.9207588621648,
                        -607.483759406954
                    ],
                    [
                        544.5356540434295,
                        -595.8161468403414
                    ],
                    [
                        553.457229559659,
                        -580.3929820815101
                    ],
                    [
                        562.5050112393219,
                        -564.9102260358632
                    ],
                    [
                        571.5283947080025,
                        -549.5211542742327
                    ],
                    [
                        580.7202526843757,
                        -533.9948001308367
                    ],
                    [
                        589.9850890713278,
                        -518.6880549937487
                    ],
                    [
                        599.3840721396264,
                        -503.06075480021536
                    ],
                    [
                        608.7138493679231,
                        -487.76261369884014
                    ],
                    [
                        614.9975026580505,
                        -477.5696440404281
                    ],
                    [
                        618.0228463067906,
                        -472.74386707507074
                    ],
                    [
                        623.4825428037439,
                        -464.04932080581784
                    ],
                    [
                        626.4795847853529,
                        -459.1308301994577
                    ],
                    [
                        629.7290324733476,
                        -453.9490120243281
                    ],
                    [
                        632.8626451449818,
                        -448.99215284734964
                    ],
                    [
                        636.1425803602906,
                        -443.70455253403634
                    ],
                    [
                        639.2726679954794,
                        -438.8803580822423
                    ],
                    [
                        642.6347135179094,
                        -433.78579563926905
                    ],
                    [
                        645.748579142557,
                        -428.9031128603965
                    ],
                    [
                        649.0705711718765,
                        -423.6621130006388
                    ],
                    [
                        655.613921368029,
                        -413.5644857659936
                    ],
                    [
                        658.7327243300388,
                        -408.6954662259668
                    ],
                    [
                        662.1796855363646,
                        -403.2506651347503
                    ],
                    [
                        665.2470912105637,
                        -398.5692886784673
                    ],
                    [
                        668.6115377092501,
                        -393.32160703558475
                    ],
                    [
                        671.7282476169639,
                        -388.5615190323442
                    ],
                    [
                        675.1896012821235,
                        -383.41238051466644
                    ],
                    [
                        678.4133420995204,
                        -378.56574146077037
                    ],
                    [
                        681.7739845156902,
                        -373.4035341134295
                    ],
                    [
                        684.9975005415035,
                        -368.62856582924724
                    ],
                    [
                        688.409939126228,
                        -363.46329823322594
                    ],
                    [
                        691.6400731710019,
                        -358.64785143826157
                    ],
                    [
                        695.0543468173128,
                        -353.44540236890316
                    ],
                    [
                        698.28114545485,
                        -348.7520721675828
                    ],
                    [
                        701.8136272153351,
                        -343.5914087826386
                    ],
                    [
                        705.0448797778226,
                        -338.73010001145303
                    ],
                    [
                        708.6239066716516,
                        -333.51363690942526
                    ],
                    [
                        711.7503079071175,
                        -328.93928687646985
                    ],
                    [
                        715.4512868805323,
                        -323.6397420372814
                    ],
                    [
                        718.6113487966941,
                        -319.02508176863194
                    ],
                    [
                        722.2314167689765,
                        -313.7740385038778
                    ],
                    [
                        725.3533355441759,
                        -309.2561878170818
                    ],
                    [
                        729.0126650093589,
                        -303.8868552548811
                    ],
                    [
                        732.9203327422729,
                        -298.2836854821071
                    ],
                    [
                        736.5787204579683,
                        -293.0370392734185
                    ],
                    [
                        743.2041788742645,
                        -283.5575470207259
                    ],
                    [
                        753.3755123962183,
                        -269.0903082964942
                    ],
                    [
                        759.5777694184799,
                        -260.42012426164
                    ],
                    [
                        763.911271910416,
                        -254.324479136616
                    ],
                    [
                        767.325267032953,
                        -249.58936798851937
                    ],
                    [
                        777.1635322752991,
                        -235.99945428408682
                    ],
                    [
                        784.8883331859251,
                        -225.39904759917408
                    ],
                    [
                        795.4945699801901,
                        -210.86268646270037
                    ],
                    [
                        806.6770599815063,
                        -195.85000558476895
                    ],
                    [
                        810.081692371401,
                        -197.85239475686103
                    ]
                ]
            ]
        }
    ],
    [
        -3,
        {
            "type": "Polygon",
            "coordinates": [
                [
                    [
                        782.0850951406173,
                        -172.7325013326481
                    ],
                    [
                        782.313542728778,
                        -175.3479392156005
                    ],
                    [
                        782.5257418178953,
                        -178.4099829616025
                    ],
                    [
                        782.5707230769913,
                        -181.5341436844319
                    ],
                    [
                        782.6307747752871,
                        -185.25734791252762
                    ],
                    [
                        782.5480406382121,
                        -188.62090492341667
                    ],
                    [
                        782.2553739155992,
                        -193.1933154212311
                    ],
                    [
                        781.9273038305109,
                        -196.61360704526305
                    ],
                    [
                        781.418868524197,
                        -200.21631975099444
                    ],
                    [
                        780.3980452197138,
                        -205.7963319187984
                    ],
                    [
                        779.1377461124794,
                        -211.61958238109946
                    ],
                    [
                        777.4002923780354,
                        -218.1052327323705
                    ],
                    [
                        775.6161644608947,
                        -223.83114553708583
                    ],
                    [
                        774.3502152620349,
                        -227.6781709678471
                    ],
                    [
                        772.1578228645958,
                        -233.48056529834867
                    ],
                    [
                        769.1564913231414,
                        -240.97802933771163
                    ],
                    [
                        766.7086385850562,
                        -246.61475729197264
                    ],
                    [
                        763.9889049437479,
                        -251.7906025731936
                    ],
                    [
                        761.477453222964,
                        -256.4522968363017
                    ],
                    [
                        759.0663535972126,
                        -260.60978445317596
                    ],
                    [
                        755.9787276464049,
                        -265.4217630662024
                    ],
                    [
                        752.0984184312983,
                        -270.9584427867085
                    ],
                    [
                        748.4445674201706,
                        -276.1267213411629
                    ],
                    [
                        744.0000103753409,
                        -282.4583470970392
                    ],
                    [
                        741.4874330757302,
                        -285.95775218866765
                    ],
                    [
                        739.9803883272689,
                        -288.2107241069898
                    ],
                    [
                        735.2378040748881,
                        -294.92575682979077
                    ],
                    [
                        728.9495960039785,
                        -304.025225173682
                    ],
                    [
                        725.4929681743961,
                        -309.08347184956074
                    ],
                    [
                        722.129651626572,
                        -313.8350691925734
                    ],
                    [
                        718.6248112316825,
                        -318.96212344802916
                    ],
                    [
                        715.2725888746791,
                        -323.8601940376684
                    ],
                    [
                        711.7720123073086,
                        -328.97507340833545
                    ],
                    [
                        708.5440714221913,
                        -333.608884668909
                    ],
                    [
                        705.1203389720758,
                        -338.69994370732456
                    ],
                    [
                        701.8622768620262,
                        -343.688816094771
                    ],
                    [
                        698.422674108413,
                        -348.6920674825087
                    ],
                    [
                        694.9851315872511,
                        -353.54980564210564
                    ],
                    [
                        691.6452336728689,
                        -358.6095563657582
                    ],
                    [
                        688.4138766027754,
                        -363.508516414091
                    ],
                    [
                        685.0542345076101,
                        -368.537330199033
                    ],
                    [
                        681.8715265196515,
                        -373.4821624336764
                    ],
                    [
                        678.4220860659843,
                        -378.5499773072079
                    ],
                    [
                        675.2553775226697,
                        -383.4563588453457
                    ],
                    [
                        671.8075345675461,
                        -388.5600263001397
                    ],
                    [
                        668.6372878879774,
                        -393.4850773802027
                    ],
                    [
                        665.300607835059,
                        -398.5899550495669
                    ],
                    [
                        662.1310586116742,
                        -403.4721470642835
                    ],
                    [
                        658.7182510314742,
                        -408.6090732207522
                    ],
                    [
                        655.6479425692232,
                        -413.6261973846704
                    ],
                    [
                        652.2722980339313,
                        -418.6907572215423
                    ],
                    [
                        645.8117198306136,
                        -428.7238657819107
                    ],
                    [
                        639.3384407010744,
                        -438.89362453017384
                    ],
                    [
                        636.1591989359586,
                        -443.76641502883285
                    ],
                    [
                        632.9041838112753,
                        -448.9870121385902
                    ],
                    [
                        629.806439282489,
                        -453.90898953098804
                    ],
                    [
                        626.4350723210955,
                        -459.2733847182244
                    ],
                    [
                        623.4336864533834,
                        -464.10224873386323
                    ],
                    [
                        621.4381550615653,
                        -466.9494120310992
                    ],
                    [
                        623.0709300260642,
                        -463.7673247111961
                    ],
                    [
                        625.2911545162788,
                        -459.74979688972235
                    ],
                    [
                        627.62925762753,
                        -455.3696661340073
                    ],
                    [
                        631.2559964620741,
                        -448.51090851891786
                    ],
                    [
                        642.8411306270282,
                        -426.8253002250567
                    ],
                    [
                        647.9239961955464,
                        -418.4006961276755
                    ],
                    [
                        653.8459990688134,
                        -409.25512967351824
                    ],
                    [
                        657.8141776006669,
                        -403.2439204696566
                    ],
                    [
                        661.9552062861621,
                        -396.8666151519865
                    ],
                    [
                        668.2531359475106,
                        -387.2074448382482
                    ],
                    [
                        675.2792564877309,
                        -376.7842854736373
                    ],
                    [
                        681.641692994046,
                        -366.9990849895403
                    ],
                    [
                        688.4028626049985,
                        -356.7985456548631
                    ],
                    [
                        698.9054510931601,
                        -341.26086657401174
                    ],
                    [
                        701.7986029984313,
                        -337.01863572373986
                    ],
                    [
                        706.6553799964022,
                        -329.9764636764303
                    ],
                    [
                        711.9731158682844,
                        -322.12617567088455
                    ],
                    [
                        718.8625346767367,
                        -312.18125699460506
                    ],
                    [
                        725.5385875718202,
                        -302.422041548416
                    ],
                    [
                        736.587304396613,
                        -286.4000059776008
                    ],
                    [
                        742.9000123927835,
                        -277.44959195517004
                    ],
                    [
                        749.632100229268,
                        -267.69357844255865
                    ],
                    [
                        752.2224383739522,
                        -263.8488530283794
                    ],
                    [
                        754.6204672754975,
                        -260.0074152722955
                    ],
                    [
                        757.5822029259871,
                        -255.10761323291808
                    ],
                    [
                        760.9662086263415,
                        -248.70661351829767
                    ],
                    [
                        765.1554998896318,
                        -240.27033962588757
                    ],
                    [
                        767.1109250396257,
                        -235.67052401416004
                    ],
                    [
                        768.7622024309821,
                        -231.82237041089684
                    ],
                    [
                        770.7290764486534,
                        -226.56953743100166
                    ],
                    [
                        773.0538377951598,
                        -219.66421933472157
                    ],
                    [
                        775.499695401697,
                        -210.933216878213
                    ],
                    [
                        776.7688532633474,
                        -205.16358569730073
                    ],
                    [
                        777.7778000787366,
                        -199.30295058246702
                    ],
                    [
                        778.6104500941001,
                        -192.1673342268914
                    ],
                    [
                        778.8630741060479,
                        -187.0107414200902
                    ],
                    [
                        778.8283962057321,
                        -181.38946749363095
                    ],
                    [
                        778.7360982724931,
                        -176.77530380897224
                    ],
                    [
                        778.3574974841904,
                        -172.6901849564165
                    ],
                    [
                        778.2641561048804,
                        -171.96030475292355
                    ],
                    [
                        782.0850951406173,
                        -172.7325013326481
                    ]
                ]
            ]
        }
    ]
            # 将 JSON 数据转换为包含 Polygon 对象的列表

]
           

            lanes_polygons_39_52 = [
                (index, shape(polygon_dict)) for index, polygon_dict in json_data
            ]

            # 更新playground39-52的轨迹数据
            input_file_39_52 = f'{index}_tracks.csv'
            output_file_39_52 = f'{index}_updated_tracks.csv'
            #playground39_52.update_track_data(input_file_39_52, output_file_39_52, onramp_polygons_39_52, offramp_polygons_39_52, lanes_polygons_39_52)
            updated_tracks_df = playground39_52.extract_turn_type_and_lane(input_file_39_52, onramp_polygons_39_52, offramp_polygons_39_52, lanes_polygons_39_52)

            #plot_polygons_from_json(json_data, ax)
            # Set labels, title, and other plot parameters
            ax.set_xlabel("X Coordinate")
            ax.set_ylabel("Y Coordinate")
            ax.set_title("Visualization of Polygons from JSON Data")
            ax.legend()
            ax.grid(True)
            ax.axis('equal')

            # Show the plot
            #plt.show()
            
            return json_data, updated_tracks_df
        
        elif 53 <= index <= 60:

            # 提供的 JSON 数据
            json_data = {
                "playground53-60_lane-3_OnRamp": [
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    223.58338449295843,
                                    -128.0273137204349
                                ],
                                [
                                    192.26323484949535,
                                    -113.11643671337515
                                ],
                                [
                                    173.12065171304857,
                                    -110.46281152684242
                                ],
                                [
                                    156.6132822323707,
                                    -113.41854413133115
                                ],
                                [
                                    138.20514047151664,
                                    -122.68086718861014
                                ],
                                [
                                    129.72205294534797,
                                    -129.91261112876236
                                ],
                                [
                                    133.70443896419602,
                                    -133.39887781720608
                                ],
                                [
                                    141.736638714734,
                                    -126.64131337963045
                                ],
                                [
                                    158.16590475983685,
                                    -118.38563675433397
                                ],
                                [
                                    172.95008070126642,
                                    -115.7540500825271
                                ],
                                [
                                    191.0450799096143,
                                    -117.95953868981451
                                ],
                                [
                                    221.86966175981797,
                                    -131.18159038946033
                                ],
                                [
                                    223.58338449295843,
                                    -128.0273137204349
                                ]
                            ]
                        ]
                    },
                    -3
                ]
            }

            # 将 JSON 数据转换为包含 Polygon 对象的字典
            onramp_polygons_53_60 = {
                key: (shape(polygon_dict), value) for key, (polygon_dict, value) in json_data.items()
            } 
            # 提供的 JSON 数据
            json_data = {
                "playground53-60_lane3_OffRamp": [
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    197.51190760784084,
                                    -90.91433231905103
                                ],
                                [
                                    158.12112418928882,
                                    -65.67478009033948
                                ],
                                [
                                    142.68293568259105,
                                    -45.06852611619979
                                ],
                                [
                                    135.9712366592139,
                                    -28.777733232825994
                                ],
                                [
                                    132.684275651176,
                                    -14.30917145870626
                                ],
                                [
                                    137.8017475529341,
                                    -13.61771634221077
                                ],
                                [
                                    140.74390690383734,
                                    -27.770826203748584
                                ],
                                [
                                    147.4138604705804,
                                    -43.37214694172144
                                ],
                                [
                                    161.42728643032024,
                                    -61.88382932450622
                                ],
                                [
                                    199.0122889878694,
                                    -87.70675852801651
                                ],
                                [
                                    197.51190760784084,
                                    -90.91433231905103
                                ]
                            ]
                        ]
                    },
                    3
                ]
            }

            # 将 JSON 数据转换为包含 Polygon 对象的字典
            offramp_polygons_53_60 = {
                key: (shape(polygon_dict), value) for key, (polygon_dict, value) in json_data.items()
            }
           # 提供的 JSON 数据
            json_data = [
                [
                    1,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    117.20271561591653,
                                    -58.938874788582325
                                ],
                                [
                                    229.44932671432616,
                                    -116.66345312166959
                                ],
                                [
                                    397.9694953231956,
                                    -214.89697796013206
                                ],
                                [
                                    532.8395297052921,
                                    -304.51059701666236
                                ],
                                [
                                    632.8117391615524,
                                    -377.8651793738827
                                ],
                                [
                                    635.1499898479669,
                                    -374.76201635506004
                                ],
                                [
                                    535.0786481642281,
                                    -301.06720384955406
                                ],
                                [
                                    399.92788268980803,
                                    -211.38999832514673
                                ],
                                [
                                    231.4318656352698,
                                    -113.3328992659226
                                ],
                                [
                                    118.91059820359806,
                                    -55.43421153817326
                                ],
                                [
                                    117.20271561591653,
                                    -58.938874788582325
                                ]
                            ]
                        ]
                    }
                ],
                [
                    2,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    118.91059820359806,
                                    -55.43421153817326
                                ],
                                [
                                    231.4318656352698,
                                    -113.3328992659226
                                ],
                                [
                                    399.92788268980803,
                                    -211.38999832514673
                                ],
                                [
                                    535.0786481642281,
                                    -301.06720384955406
                                ],
                                [
                                    635.1499898479669,
                                    -374.76201635506004
                                ],
                                [
                                    637.4144628685317,
                                    -371.501572615467
                                ],
                                [
                                    537.3629221259034,
                                    -297.9485155874863
                                ],
                                [
                                    362.67262475087773,
                                    -183.74338776618242
                                ],
                                [
                                    197.51190760784084,
                                    -90.91433231905103
                                ],
                                [
                                    120.60195964894956,
                                    -52.01342283282429
                                ],
                                [
                                    118.91059820359806,
                                    -55.43421153817326
                                ]
                            ]
                        ]
                    }
                ],
                [
                    3,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    362.67262475087773,
                                    -183.74338776618242
                                ],
                                [
                                    197.51190760784084,
                                    -90.91433231905103
                                ],
                                [
                                    158.12112418928882,
                                    -65.67478009033948
                                ],
                                [
                                    142.68293568259105,
                                    -45.06852611619979
                                ],
                                [
                                    135.9712366592139,
                                    -28.777733232825994
                                ],
                                [
                                    132.684275651176,
                                    -14.30917145870626
                                ],
                                [
                                    137.8017475529341,
                                    -13.61771634221077
                                ],
                                [
                                    140.74390690383734,
                                    -27.770826203748584
                                ],
                                [
                                    147.4138604705804,
                                    -43.37214694172144
                                ],
                                [
                                    161.42728643032024,
                                    -61.88382932450622
                                ],
                                [
                                    199.0122889878694,
                                    -87.70675852801651
                                ],
                                [
                                    345.9566527066636,
                                    -169.8531254865229
                                ],
                                [
                                    362.67262475087773,
                                    -183.74338776618242
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -1,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    115.22734667401528,
                                    -63.193462835624814
                                ],
                                [
                                    227.2205741875223,
                                    -120.83693976514041
                                ],
                                [
                                    395.4332379512489,
                                    -218.91724339220673
                                ],
                                [
                                    530.1730520018027,
                                    -308.562404721044
                                ],
                                [
                                    629.8837721864111,
                                    -381.7960853353143
                                ],
                                [
                                    627.9504478701274,
                                    -385.1334453076124
                                ],
                                [
                                    528.1258461243124,
                                    -311.7245090967044
                                ],
                                [
                                    393.3076447880012,
                                    -222.24247655738145
                                ],
                                [
                                    225.63613232941134,
                                    -124.20627369266003
                                ],
                                [
                                    113.4513862291933,
                                    -66.64918459579349
                                ],
                                [
                                    115.22734667401528,
                                    -63.193462835624814
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -2,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    113.4513862291933,
                                    -66.64918459579349
                                ],
                                [
                                    225.63613232941134,
                                    -124.20627369266003
                                ],
                                [
                                    393.3076447880012,
                                    -222.24247655738145
                                ],
                                [
                                    528.1258461243124,
                                    -311.7245090967044
                                ],
                                [
                                    627.9504478701274,
                                    -385.1334453076124
                                ],
                                [
                                    625.8340475181467,
                                    -388.2124215774238
                                ],
                                [
                                    525.9742620319012,
                                    -314.842709492892
                                ],
                                [
                                    393.88254722207785,
                                    -227.3482881207019
                                ],
                                [
                                    223.58338449295843,
                                    -128.0273137204349
                                ],
                                [
                                    111.88539303623838,
                                    -70.06441183015704
                                ],
                                [
                                    113.4513862291933,
                                    -66.64918459579349
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -3,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    393.88254722207785,
                                    -227.3482881207019
                                ],
                                [
                                    223.58338449295843,
                                    -128.0273137204349
                                ],
                                [
                                    192.26323484949535,
                                    -113.11643671337515
                                ],
                                [
                                    173.12065171304857,
                                    -110.46281152684242
                                ],
                                [
                                    156.6132822323707,
                                    -113.41854413133115
                                ],
                                [
                                    138.20514047151664,
                                    -122.68086718861014
                                ],
                                [
                                    129.72205294534797,
                                    -129.91261112876236
                                ],
                                [
                                    133.70443896419602,
                                    -133.39887781720608
                                ],
                                [
                                    141.736638714734,
                                    -126.64131337963045
                                ],
                                [
                                    158.16590475983685,
                                    -118.38563675433397
                                ],
                                [
                                    172.95008070126642,
                                    -115.7540500825271
                                ],
                                [
                                    191.0450799096143,
                                    -117.95953868981451
                                ],
                                [
                                    221.86966175981797,
                                    -131.18159038946033
                                ],
                                [
                                    365.73461041244445,
                                    -213.55968860723078
                                ],
                                [
                                    393.88254722207785,
                                    -227.3482881207019
                                ]
                            ]
                        ]
                    }
                ]
            ]

            # 将 JSON 数据转换为包含 Polygon 对象的列表
            lanes_polygons_53_60 = [
                (index, shape(polygon_dict)) for index, polygon_dict in json_data
            ]

            # 更新playground53-60的轨迹数据
            input_file_53_60 = f'{index}_tracks.csv'
            output_file_53_60 = f'{index}_updated_tracks.csv'
            #playground53_60.update_track_data(input_file_53_60, output_file_53_60, onramp_polygons_53_60, offramp_polygons_53_60, lanes_polygons_53_60)
            updated_tracks_df = playground53_60.extract_turn_type_and_lane(input_file_53_60, onramp_polygons_53_60, offramp_polygons_53_60, lanes_polygons_53_60)

            
            #plot_polygons_from_json(json_data, ax)
            # Set labels, title, and other plot parameters
            ax.set_xlabel("X Coordinate")
            ax.set_ylabel("Y Coordinate")
            ax.set_title("Visualization of Polygons from JSON Data")
            ax.legend()
            ax.grid(True)
            ax.axis('equal')

            # Show the plot
            #plt.show()
            
            return json_data, updated_tracks_df
        
        elif 61 <= index <= 72:
            # 提供的 JSON 数据
            json_data = {
                "playground61-72_lane-4_OnRamp": [
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    206.2076705044601,
                                    -115.37323923502117
                                ],
                                [
                                    227.88828218803974,
                                    -115.57763012405485
                                ],
                                [
                                    250.43598903343081,
                                    -122.48490178119391
                                ],
                                [
                                    283.2511679963209,
                                    -142.53341248910874
                                ],
                                [
                                    281.1516709565767,
                                    -145.75687058549374
                                ],
                                [
                                    248.9384520109743,
                                    -126.29956251103431
                                ],
                                [
                                    226.94264434929937,
                                    -120.38067143782973
                                ],
                                [
                                    206.47340086544864,
                                    -120.21420096978545
                                ],
                                [
                                    206.2076705044601,
                                    -115.37323923502117
                                ]
                            ]
                        ]
                    },
                    -4
                ]
            }

            # 将 JSON 数据转换为包含 Polygon 对象的字典
            onramp_polygons_61_72 = {
                key: (shape(polygon_dict), value) for key, (polygon_dict, value) in json_data.items()
            }
            # 提供的 JSON 数据
            json_data = {
                "playground61-72_lane5_OffRamp": [
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    565.5234739436419,
                                    -310.9411968300119
                                ],
                                [
                                    534.8999565317063,
                                    -288.78701154422015
                                ],
                                [
                                    496.6148354165489,
                                    -261.2809901004657
                                ],
                                [
                                    260.54205231240485,
                                    -74.44542392715812
                                ],
                                [
                                    252.00208915304393,
                                    -59.33214652817696
                                ],
                                [
                                    248.52432821883122,
                                    -49.946176561526954
                                ],
                                [
                                    253.22605462610954,
                                    -49.89816542621702
                                ],
                                [
                                    255.99231852043886,
                                    -56.84220281802118
                                ],
                                [
                                    263.65351855778135,
                                    -71.50808530393988
                                ],
                                [
                                    499.32528877130244,
                                    -257.9632156332955
                                ],
                                [
                                    537.1020240220823,
                                    -285.77878213394433
                                ],
                                [
                                    567.9139405603055,
                                    -308.14936825819314
                                ],
                                [
                                    565.5234739436419,
                                    -310.9411968300119
                                ]
                            ]
                        ]
                    },
                    5
                ]
            }

            # 将 JSON 数据转换为包含 Polygon 对象的字典
            offramp_polygons_61_72 = {
                key: (shape(polygon_dict), value) for key, (polygon_dict, value) in json_data.items()
            }

            # 提供的 JSON 数据
            json_data = [
                [
                    1,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    199.7528698508395,
                                    -58.88251463882625
                                ],
                                [
                                    421.8922060029581,
                                    -228.3810955826193
                                ],
                                [
                                    589.8540199060226,
                                    -356.57166468631476
                                ],
                                [
                                    592.8856647034409,
                                    -354.1953278807923
                                ],
                                [
                                    423.9843883778667,
                                    -225.4016336640343
                                ],
                                [
                                    201.73108322860207,
                                    -55.73038669489324
                                ],
                                [
                                    199.7528698508395,
                                    -58.88251463882625
                                ]
                            ]
                        ]
                    }
                ],
                [
                    2,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    201.73108322860207,
                                    -55.73038669489324
                                ],
                                [
                                    423.9843883778667,
                                    -225.4016336640343
                                ],
                                [
                                    592.8856647034409,
                                    -354.1953278807923
                                ],
                                [
                                    595.1826933711418,
                                    -351.4235248453915
                                ],
                                [
                                    426.1397002771264,
                                    -222.43411164637655
                                ],
                                [
                                    204.19483034696896,
                                    -52.6755635291338
                                ],
                                [
                                    201.73108322860207,
                                    -55.73038669489324
                                ]
                            ]
                        ]
                    }
                ],
                [
                    3,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    204.19483034696896,
                                    -52.6755635291338
                                ],
                                [
                                    426.1397002771264,
                                    -222.43411164637655
                                ],
                                [
                                    595.1826933711418,
                                    -351.4235248453915
                                ],
                                [
                                    597.9844595876639,
                                    -348.5840550046414
                                ],
                                [
                                    429.0937870767666,
                                    -219.4894353542477
                                ],
                                [
                                    206.5563710021088,
                                    -49.749009487219155
                                ],
                                [
                                    204.19483034696896,
                                    -52.6755635291338
                                ]
                            ]
                        ]
                    }
                ],
                [
                    4,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    260.22034040943254,
                                    -90.38586152438074
                                ],
                                [
                                    429.0937870767666,
                                    -219.4894353542477
                                ],
                                [
                                    466.100724158925,
                                    -247.48745163250715
                                ],
                                [
                                    532.5083125162637,
                                    -291.61650065146387
                                ],
                                [
                                    563.268279851065,
                                    -313.83217592630535
                                ],
                                [
                                    596.5461311991094,
                                    -339.2740910788998
                                ],
                                [
                                    598.8085226374096,
                                    -336.30775270145386
                                ],
                                [
                                    565.5234739436419,
                                    -310.9411968300119
                                ],
                                [
                                    534.8999565317063,
                                    -288.78701154422015
                                ],
                                [
                                    468.6873936757911,
                                    -244.40049742907286
                                ],
                                [
                                    296.676552525023,
                                    -113.62161269597709
                                ],
                                [
                                    260.22034040943254,
                                    -90.38586152438074
                                ]
                            ]
                        ]
                    }
                ],
                [
                    5,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    598.8085226374096,
                                    -336.30775270145386
                                ],
                                [
                                    565.5234739436419,
                                    -310.9411968300119
                                ],
                                [
                                    534.8999565317063,
                                    -288.78701154422015
                                ],
                                [
                                    496.6148354165489,
                                    -261.2809901004657
                                ],
                                [
                                    260.54205231240485,
                                    -74.44542392715812
                                ],
                                [
                                    252.00208915304393,
                                    -59.33214652817696
                                ],
                                [
                                    248.52432821883122,
                                    -49.946176561526954
                                ],
                                [
                                    253.22605462610954,
                                    -49.89816542621702
                                ],
                                [
                                    255.99231852043886,
                                    -56.84220281802118
                                ],
                                [
                                    263.65351855778135,
                                    -71.50808530393988
                                ],
                                [
                                    499.32528877130244,
                                    -257.9632156332955
                                ],
                                [
                                    537.1020240220823,
                                    -285.77878213394433
                                ],
                                [
                                    567.9139405603055,
                                    -308.14936825819314
                                ],
                                [
                                    601.3802907891222,
                                    -333.87199932616204
                                ],
                                [
                                    598.8085226374096,
                                    -336.30775270145386
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -1,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    196.34060166415293,
                                    -63.266610086895525
                                ],
                                [
                                    419.1478538449155,
                                    -231.83256856910884
                                ],
                                [
                                    512.2971844507847,
                                    -302.25334256421775
                                ],
                                [
                                    587.6115253046155,
                                    -359.4205900076777
                                ],
                                [
                                    585.3774578514276,
                                    -362.6438646428287
                                ],
                                [
                                    510.1847485131584,
                                    -305.4217784088105
                                ],
                                [
                                    416.79674175276887,
                                    -234.69771222490817
                                ],
                                [
                                    194.09432631719392,
                                    -65.95914579648525
                                ],
                                [
                                    196.34060166415293,
                                    -63.266610086895525
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -2,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    194.09432631719392,
                                    -65.95914579648525
                                ],
                                [
                                    416.79674175276887,
                                    -234.69771222490817
                                ],
                                [
                                    510.1847485131584,
                                    -305.4217784088105
                                ],
                                [
                                    585.3774578514276,
                                    -362.6438646428287
                                ],
                                [
                                    583.5846246602596,
                                    -365.28971661347896
                                ],
                                [
                                    508.55773212667555,
                                    -307.7751582786441
                                ],
                                [
                                    415.0155542079592,
                                    -236.87643437180668
                                ],
                                [
                                    191.61249600618612,
                                    -68.93761909846216
                                ],
                                [
                                    194.09432631719392,
                                    -65.95914579648525
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -3,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    191.61249600618612,
                                    -68.93761909846216
                                ],
                                [
                                    415.0155542079592,
                                    -236.87643437180668
                                ],
                                [
                                    508.55773212667555,
                                    -307.7751582786441
                                ],
                                [
                                    583.5846246602596,
                                    -365.28971661347896
                                ],
                                [
                                    581.0525071910815,
                                    -368.12281759176403
                                ],
                                [
                                    506.23980621260125,
                                    -311.10373738687485
                                ],
                                [
                                    412.42346060601994,
                                    -240.28948007244617
                                ],
                                [
                                    189.47076355689205,
                                    -71.79049652069807
                                ],
                                [
                                    191.61249600618612,
                                    -68.93761909846216
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -4,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    206.2076705044601,
                                    -115.37323923502117
                                ],
                                [
                                    227.88828218803974,
                                    -115.57763012405485
                                ],
                                [
                                    250.43598903343081,
                                    -122.48490178119391
                                ],
                                [
                                    283.2511679963209,
                                    -142.53341248910874
                                ],
                                [
                                    412.42346060601994,
                                    -240.28948007244617
                                ],
                                [
                                    506.23980621260125,
                                    -311.10373738687485
                                ],
                                [
                                    581.0525071910815,
                                    -368.12281759176403
                                ],
                                [
                                    578.8145715391147,
                                    -370.9800532720983
                                ],
                                [
                                    503.87060799542814,
                                    -314.1458373051137
                                ],
                                [
                                    410.3676430612104,
                                    -243.32052029576153
                                ],
                                [
                                    281.1516709565767,
                                    -145.75687058549374
                                ],
                                [
                                    248.9384520109743,
                                    -126.29956251103431
                                ],
                                [
                                    226.94264434929937,
                                    -120.38067143782973
                                ],
                                [
                                    206.47340086544864,
                                    -120.21420096978545
                                ],
                                [
                                    206.2076705044601,
                                    -115.37323923502117
                                ]
                            ]
                        ]
                    }
                ]
            ]

            # 将 JSON 数据转换为包含 Polygon 对象的列表
            lanes_polygons_61_72 = [
                (index, shape(polygon_dict)) for index, polygon_dict in json_data
            ]

            # 更新playground61-72的轨迹数据
            input_file_61_72 = f'{index}_tracks.csv'
            output_file_61_72 = f'{index}_updated_tracks.csv'
            #playground61_72.update_track_data(input_file_61_72, output_file_61_72, onramp_polygons_61_72, offramp_polygons_61_72, lanes_polygons_61_72)
            updated_tracks_df = playground61_72.extract_turn_type_and_lane(input_file_61_72, onramp_polygons_61_72, offramp_polygons_61_72, lanes_polygons_61_72)
            
            #plot_polygons_from_json(json_data, ax)
            # Set labels, title, and other plot parameters
            ax.set_xlabel("X Coordinate")
            ax.set_ylabel("Y Coordinate")
            ax.set_title("Visualization of Polygons from JSON Data")
            ax.legend()
            ax.grid(True)
            ax.axis('equal')

            # Show the plot
            #plt.show()
            
            return json_data, updated_tracks_df

        elif 73 <= index <= 77:

            # 提供的 JSON 数据
            json_data = {
                "playground73-77_lane-3_2_OnRamp": [
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    456.2317980565713,
                                    -230.84965080209076
                                ],
                                [
                                    398.654124442779,
                                    -224.20319501776248
                                ],
                                [
                                    290.4496003231616,
                                    -214.50107068102807
                                ],
                                [
                                    249.25741549010854,
                                    -217.04836969822645
                                ],
                                [
                                    206.75857236643787,
                                    -231.63568141777068
                                ],
                                [
                                    173.74861418554792,
                                    -256.21120259538293
                                ],
                                [
                                    141.11146027914947,
                                    -297.3545501260087
                                ],
                                [
                                    147.84526016603922,
                                    -298.2768837790936
                                ],
                                [
                                    175.26814870012458,
                                    -263.56742668151855
                                ],
                                [
                                    249.52515570342075,
                                    -222.58917430602014
                                ],
                                [
                                    290.18457668164046,
                                    -219.91098031308502
                                ],
                                [
                                    398.3033586781821,
                                    -229.70171984098852
                                ],
                                [
                                    455.70584721810883,
                                    -235.1164313852787
                                ],
                                [
                                    456.2317980565713,
                                    -230.84965080209076
                                ]
                            ]
                        ]
                    },
                    -3
                ]
            }

            # 将 JSON 数据转换为包含 Polygon 对象的字典
            onramp_polygons_73_77 = {
                key: (shape(polygon_dict), value) for key, (polygon_dict, value) in json_data.items()
            }
            # 提供的 JSON 数据
            json_data = [
                [
                    1,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    166.84985236852663,
                                    -164.25414068624377
                                ],
                                [
                                    344.07220963336295,
                                    -202.62857048865408
                                ],
                                [
                                    489.090756805439,
                                    -220.6836821725592
                                ],
                                [
                                    620.8615620149649,
                                    -227.58154553174973
                                ],
                                [
                                    621.4395065055578,
                                    -223.57716563623399
                                ],
                                [
                                    489.2294118743739,
                                    -216.86048901546746
                                ],
                                [
                                    345.02561524457997,
                                    -198.995265125297
                                ],
                                [
                                    167.30390963266836,
                                    -160.7638707952574
                                ],
                                [
                                    166.84985236852663,
                                    -164.25414068624377
                                ]
                            ]
                        ]
                    }
                ],
                [
                    2,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    167.30390963266836,
                                    -160.7638707952574
                                ],
                                [
                                    345.02561524457997,
                                    -198.995265125297
                                ],
                                [
                                    489.2294118743739,
                                    -216.86048901546746
                                ],
                                [
                                    621.4395065055578,
                                    -223.57716563623399
                                ],
                                [
                                    622.3515688145417,
                                    -219.94125907029957
                                ],
                                [
                                    571.7737211478525,
                                    -218.10255759675056
                                ],
                                [
                                    489.89572577376384,
                                    -213.20237041916698
                                ],
                                [
                                    346.0360416874173,
                                    -195.26769498363137
                                ],
                                [
                                    168.10345733637223,
                                    -156.53046164754778
                                ],
                                [
                                    167.30390963266836,
                                    -160.7638707952574
                                ]
                            ]
                        ]
                    }
                ],
                [
                    3,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    168.10345733637223,
                                    -156.53046164754778
                                ],
                                [
                                    346.0360416874173,
                                    -195.26769498363137
                                ],
                                [
                                    489.89572577376384,
                                    -213.20237041916698
                                ],
                                [
                                    571.7737211478525,
                                    -218.10255759675056
                                ],
                                [
                                    525.331442024908,
                                    -212.000446354039
                                ],
                                [
                                    346.79337047907757,
                                    -191.32299136463553
                                ],
                                [
                                    169.34480862511555,
                                    -152.56562845315784
                                ],
                                [
                                    168.10345733637223,
                                    -156.53046164754778
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -1,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    165.8751812191913,
                                    -169.2845778465271
                                ],
                                [
                                    343.19874894974055,
                                    -207.86667210701853
                                ],
                                [
                                    488.6729970804299,
                                    -225.92117277905345
                                ],
                                [
                                    620.0126073542051,
                                    -232.8105358676985
                                ],
                                [
                                    619.2597756969626,
                                    -236.72883277572691
                                ],
                                [
                                    488.37395921879215,
                                    -229.7740030111745
                                ],
                                [
                                    342.5917526424746,
                                    -211.65504547115415
                                ],
                                [
                                    164.88852937245974,
                                    -173.04342979285866
                                ],
                                [
                                    165.8751812191913,
                                    -169.2845778465271
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -2,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    164.88852937245974,
                                    -173.04342979285866
                                ],
                                [
                                    342.5917526424746,
                                    -211.65504547115415
                                ],
                                [
                                    488.37395921879215,
                                    -229.7740030111745
                                ],
                                [
                                    619.2597756969626,
                                    -236.72883277572691
                                ],
                                [
                                    617.8033289198647,
                                    -240.17581957112998
                                ],
                                [
                                    488.1390988982166,
                                    -233.76189156528562
                                ],
                                [
                                    342.0308746805531,
                                    -215.48386460356414
                                ],
                                [
                                    164.03853953600628,
                                    -176.75943206064403
                                ],
                                [
                                    164.88852937245974,
                                    -173.04342979285866
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -3,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    164.03853953600628,
                                    -176.75943206064403
                                ],
                                [
                                    305.5049174751621,
                                    -209.1492570033297
                                ],
                                [
                                    259.01487428491237,
                                    -204.2803290626034
                                ],
                                [
                                    162.82017994992202,
                                    -181.3672174885869
                                ],
                                [
                                    164.03853953600628,
                                    -176.75943206064403
                                ]
                            ]
                        ]
                    }
                ],
                [
                    -3,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    617.8033289198647,
                                    -240.17581957112998
                                ],
                                [
                                    488.1390988982166,
                                    -233.76189156528562
                                ],
                                [
                                    456.2317980565713,
                                    -230.84965080209076
                                ],
                                [
                                    398.654124442779,
                                    -224.20319501776248
                                ],
                                [
                                    290.4496003231616,
                                    -214.50107068102807
                                ],
                                [
                                    249.25741549010854,
                                    -217.04836969822645
                                ],
                                [
                                    206.75857236643787,
                                    -231.63568141777068
                                ],
                                [
                                    173.74861418554792,
                                    -256.21120259538293
                                ],
                                [
                                    141.11146027914947,
                                    -297.3545501260087
                                ],
                                [
                                    147.84526016603922,
                                    -298.2768837790936
                                ],
                                [
                                    175.26814870012458,
                                    -263.56742668151855
                                ],
                                [
                                    249.52515570342075,
                                    -222.58917430602014
                                ],
                                [
                                    290.18457668164046,
                                    -219.91098031308502
                                ],
                                [
                                    398.3033586781821,
                                    -229.70171984098852
                                ],
                                [
                                    455.70584721810883,
                                    -235.1164313852787
                                ],
                                [
                                    487.5451225893339,
                                    -237.9811628786847
                                ],
                                [
                                    576.3207039347035,
                                    -242.95893792249262
                                ],
                                [
                                    617.8033289198647,
                                    -240.17581957112998
                                ]
                            ]
                        ]
                    }
                ]
            ]

            # 将 JSON 数据转换为包含 Polygon 对象的列表
            lanes_polygons_73_77 = [
                (index, shape(polygon_dict)) for index, polygon_dict in json_data
            ]
            # 更新playground73-77的轨迹数据
            input_file_73_77 = f'{index}_tracks.csv'
            output_file_73_77 = f'{index}_updated_tracks.csv'
            #playground73_77.update_track_data(input_file_73_77, output_file_73_77, onramp_polygons_73_77, {}, lanes_polygons_73_77)
            updated_tracks_df = playground73_77.extract_turn_type_and_lane(input_file_73_77, onramp_polygons_73_77, {}, lanes_polygons_73_77)

            #plot_polygons_from_json(json_data, ax)
            # Set labels, title, and other plot parameters
            ax.set_xlabel("X Coordinate")
            ax.set_ylabel("Y Coordinate")
            ax.set_title("Visualization of Polygons from JSON Data")
            ax.legend()
            ax.grid(True)
            ax.axis('equal')

            # Show the plot
            #plt.show()
            
            return json_data, updated_tracks_df
        
        elif 78 <= index <= 92:

            # 提供的 JSON 数据
            json_data = {
                "playground78-92_lane-4_OnRamp": [
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [
                                    229.09799224347807,
                                    -192.7720360942185
                                ],
                                [
                                    181.52490168676013,
                                    -182.55082058161497
                                ],
                                [
                                    142.16098015318858,
                                    -178.19536578841507
                                ],
                                [
                                    142.02600464527495,
                                    -182.1322208782658
                                ],
                                [
                                    181.17362394125666,
                                    -186.88141773920506
                                ],
                                [
                                    228.2494398506824,
                                    -196.0396619811654
                                ],
                                [
                                    229.09799224347807,
                                    -192.7720360942185
                                ]
                            ]
                        ]
                    },
                    -4
                ]
            }

            # 将 JSON 数据转换为包含 Polygon 对象的字典
            onramp_polygons_78_92 = {
                key: (shape(polygon_dict), value) for key, (polygon_dict, value) in json_data.items()
            }
            # 提供的 JSON 数据
            json_data = [
                [
                    1,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [161.71666925644968, -158.77304366137832],
                                [263.6138481046655, -183.71928334981203],
                                [398.96226431406103, -202.68468141369522],
                                [531.6694073449471, -205.8734359620139],
                                [625.6525993812247, -199.49685859773308],
                                [625.4627091660514, -196.0492461901158],
                                [532.088232494425, -202.46224755141884],
                                [399.58306589064887, -199.18671039678156],
                                [264.640748057398, -180.22710664570332],
                                [162.73014204425272, -155.7763953730464],
                                [161.71666925644968, -158.77304366137832]
                            ]
                        ]
                    }
                ],
                [
                    2,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [162.73014204425272, -155.7763953730464],
                                [264.640748057398, -180.22710664570332],
                                [399.58306589064887, -199.18671039678156],
                                [532.088232494425, -202.46224755141884],
                                [625.4627091660514, -196.0492461901158],
                                [625.4696691671852, -192.5553435496986],
                                [532.0676969599444, -199.08497660420835],
                                [400.24862387333997, -195.62047519814223],
                                [265.35720851202495, -177.179349033162],
                                [163.91759377671406, -152.42154890764505],
                                [162.73014204425272, -155.7763953730464]
                            ]
                        ]
                    }
                ],
                [
                    3,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [163.91759377671406, -152.42154890764505],
                                [265.35720851202495, -177.179349033162],
                                [400.24862387333997, -195.62047519814223],
                                [532.0676969599444, -199.08497660420835],
                                [625.4696691671852, -192.5553435496986],
                                [625.2222583608236, -188.38682702928782],
                                [532.350844241213, -194.91189060360193],
                                [400.7411521091708, -191.63252855557948],
                                [266.2927190720802, -173.01897241640836],
                                [164.9983187520411, -148.442154398188],
                                [163.91759377671406, -152.42154890764505]
                            ]
                        ]
                    }
                ],
                [
                    4,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [164.9983187520411, -148.442154398188],
                                [266.2927190720802, -173.01897241640836],
                                [240.26121517666616, -164.38445562962443],
                                [166.23630215507, -144.84157807473093],
                                [164.9983187520411, -148.442154398188]
                            ]
                        ]
                    }
                ],
                [
                    -1,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [160.1264579782728, -163.49117635190487],
                                [262.6576433563605, -188.74107418674976],
                                [398.7658353461884, -207.45197968930006],
                                [531.9735133151407, -210.69477769266814],
                                [626.1242311465903, -204.48631690908223],
                                [626.3111792387208, -207.93537582550198],
                                [532.1494449793827, -214.42946713324636],
                                [398.3418601072044, -211.0580907696858],
                                [262.1637209067121, -192.0681145451963],
                                [159.0023594504455, -166.78651167824864],
                                [160.1264579782728, -163.49117635190487]
                            ]
                        ]
                    }
                ],
                [
                    -2,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [159.0023594504455, -166.78651167824864],
                                [262.1637209067121, -192.0681145451963],
                                [398.3418601072044, -211.0580907696858],
                                [532.1494449793827, -214.42946713324636],
                                [626.3111792387208, -207.93537582550198],
                                [626.3239339536522, -211.70998435094953],
                                [532.1273266393691, -218.0581733621657],
                                [397.9349996271194, -214.3602666668594],
                                [261.4752896595164, -195.48493790999055],
                                [157.84891748533119, -170.24914437253028],
                                [159.0023594504455, -166.78651167824864]
                            ]
                        ]
                    }
                ],
                [
                    -3,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [157.84891748533119, -170.24914437253028],
                                [261.4752896595164, -195.48493790999055],
                                [397.9349996271194, -214.3602666668594],
                                [532.1273266393691, -218.0581733621657],
                                [626.3239339536522, -211.70998435094953],
                                [626.9010350959143, -215.48258580546826],
                                [538.2421960920328, -221.87179120071232],
                                [445.8501973710372, -221.53589808475226],
                                [397.5169586263364, -218.44168304745108],
                                [260.570892135147, -199.28493526671082],
                                [229.09799224347807, -192.7720360942185],
                                [156.9676248668693, -173.905443739146],
                                [157.84891748533119, -170.24914437253028]
                            ]
                        ]
                    }
                ],
                [
                    -4,
                    {
                        "type": "Polygon",
                        "coordinates": [
                            [
                                [445.8501973710372, -221.53589808475226],
                                [397.5169586263364, -218.44168304745108],
                                [260.570892135147, -199.28493526671082],
                                [229.09799224347807, -192.7720360942185],
                                [181.52490168676013, -182.55082058161497],
                                [142.16098015318858, -178.19536578841507],
                                [142.02600464527495, -182.1322208782658],
                                [181.17362394125666, -186.88141773920506],
                                [228.2494398506824, -196.0396619811654],
                                [260.0472922104527, -202.36944045033306],
                                [397.35230419121217, -221.4818561039865],
                                [424.1873057843768, -222.62427121121436],
                                [445.8501973710372, -221.53589808475226]
                            ]
                        ]
                    }
                ]
            ]

            # 将 JSON 数据转换为包含 Polygon 对象的列表
            lanes_polygons_78_92 = [
                (index, shape(polygon_dict)) for index, polygon_dict in json_data
            ]


            # 更新playground78-92的轨迹数据
            input_file_78_92 = f'{index}_tracks.csv'
            output_file_78_92 = f'{index}_updated_tracks.csv'
            #playground78_92.update_track_data(input_file_78_92, output_file_78_92, onramp_polygons_78_92, {}, lanes_polygons_78_92)
            updated_tracks_df = playground78_92.extract_turn_type_and_lane(input_file_78_92, onramp_polygons_78_92, {}, lanes_polygons_78_92)
            
            #plot_polygons_from_json(json_data, ax)
            # Set labels, title, and other plot parameters
            ax.set_xlabel("X Coordinate")
            ax.set_ylabel("Y Coordinate")
            ax.set_title("Visualization of Polygons from JSON Data")
            ax.legend()
            ax.grid(True)
            ax.axis('equal')

            # Show the plot
            #plt.show()
            
            return json_data, updated_tracks_df
        
def get_activity_from_LLM_response_ExitD(LLM_response):
    """
    Refine the activity from LLM response.

    Parameters:
    -----------
    Inputs:
        LLM_response (dict): a dictionary containing LLM response
        dataset_option (str): the dataset option (highD, exitD, etc.)

    Returns:
        req_ego_latAct (str): required lateral activity of ego vehicle
        req_ego_lonAct (str): required longitudinal activity of ego vehicle 
        req_ego_rampAct (str, optional): required ramp activity of ego vehicle (only for exitD)
        req_tgt_startPos (str): required start position of target vehicle 
        req_tgt_endPos (str): required end position of target vehicle 
        req_tgt_latAct (str): required lateral activity of target vehicle 
        req_tgt_longAct (str): required longitudinal activity of target vehicle
        req_tgt_rampAct (str, optional): required ramp activity of target vehicle (only for exitD)
    ----------
    """

    # Ego 
    req_ego_latAct = LLM_response['Ego Vehicle']['Ego lateral activity'][0]
    req_ego_lonAct = LLM_response['Ego Vehicle']['Ego longitudinal activity'][0]
    
    req_ego_rampAct = None
    req_ego_rampAct = LLM_response['Ego Vehicle']['Ego ramp activity'][0]

    # Target
    # Target start position
    tgt_startPos = LLM_response['Target Vehicle #1']['Target start position']
    start_item = list(tgt_startPos.items())[0]
    req_tgt_startPos = start_item[1][0]
    # Target end position
    tgt_endPos = LLM_response['Target Vehicle #1']['Target end position']
    end_item = list(tgt_endPos.items())[0]
    req_tgt_endPos = end_item[1][0]

    # Target lateral and longitudinal activity
    req_tgt_latAct = LLM_response['Target Vehicle #1']['Target behavior']['target lateral activity'][0]
    req_tgt_longAct = LLM_response['Target Vehicle #1']['Target behavior']['target longitudinal activity'][0]
    req_tgt_rampAct = None
    req_tgt_rampAct = LLM_response['Target Vehicle #1']['Target behavior']['target ramp activity'][0]

    return req_ego_latAct, req_ego_lonAct, req_ego_rampAct, req_tgt_startPos, req_tgt_endPos, req_tgt_latAct, req_tgt_longAct, req_tgt_rampAct


def get_activity_from_LLM_response_ExitD_Ramp(LLM_response):
    """
    Refine the activity from LLM response.

    Parameters:
    -----------
    Inputs:
        LLM_response (dict): a dictionary containing LLM response
        dataset_option (str): the dataset option (highD, exitD, etc.)

    Returns:
        req_ego_latAct (str): required lateral activity of ego vehicle
        req_ego_lonAct (str): required longitudinal activity of ego vehicle 
        req_ego_rampAct (str, optional): required ramp activity of ego vehicle (only for exitD)
        req_tgt_startPos (str): required start position of target vehicle 
        req_tgt_endPos (str): required end position of target vehicle 
        req_tgt_latAct (str): required lateral activity of target vehicle 
        req_tgt_longAct (str): required longitudinal activity of target vehicle
        req_tgt_rampAct (str, optional): required ramp activity of target vehicle (only for exitD)
    ----------
    """

    # Ego 
    req_ego_rampAct = LLM_response['Ego Vehicle']['Ego ramp activity'][0]

    req_tgt_rampAct = LLM_response['Target Vehicle #1']['Target ramp activity'][0]

    return  req_ego_rampAct, req_tgt_rampAct

def  mainFunctionScenarioIdentification_ExitD(tracks_36, key_label, latActDict, longActDict, interactIdDict, progress_bar,file_path):
    """
    main function to search the desired scenarios

    Parameters:
    -----------
    Inputs:
        track_36 (df): track read by pd.read_csv()
        key_label (dict): LLM response
        latActDict (dict): [key: egoID; value: df['frame', 'id', 'LateralActivity', 'lateral', 'x', 'y']]
        longActDict (dict): [key: egoID; value: df['frame', 'id', 'LongitudinalActivity', 'lateral', 'x', 'y']]
        interactIdDict (dict): [key: id; value: ID of interacting targets] 
        progress_bar (st.progress(0)): initialize the progress bar

    Returns:
        scenarioLists (list): a list contains multiple sublist in the format of [egoID, [tgtID], begFrame, endFrame]
    ----------
    """
    if 'Ego lateral activity' in key_label['Ego Vehicle']:
        req_ego_latAct, req_ego_lonAct, req_tgt_startPos, req_tgt_endPos, \
        req_tgt_latAct, req_tgt_longAct , req_tgt_startPos_type, req_tgt_endPos_type = get_activity_from_LLM_response(key_label)
        scenarioLists = []
        for key in latActDict:
            scenarioList = []

            # Current ego vehicle and interacting targets
            curr_ego = key  # current ego id
            curr_ego_latActs = latActDict[curr_ego]  # current ego lateral activities
            curr_ego_lonActs = longActDict[curr_ego]  # current ego longitudinal activities
            curr_interact_tgts = interactIdDict[curr_ego]  # targets interacting with current ego

            # Judge the ego vehicle lateral activity
            if req_ego_latAct not in curr_ego_latActs['LateralActivity'].values:
                continue
            egoLatActFram = find_start_end_frame_of_latAct(curr_ego_latActs, req_ego_latAct)
            egoLatAct_endFrame = egoLatActFram[1]
            # Check the ego vehicle ramp activity
            '''
            curr_ego_rampActs = tracks_36[tracks_36['trackId'] == curr_ego]['activity_type'].unique()
            if req_ego_rampAct not in curr_ego_rampActs:
                continue
            '''
            tgt_list = []
            for curr_interact_tgt in curr_interact_tgts:
                if curr_interact_tgt == -1 or curr_interact_tgt not in latActDict or curr_interact_tgt not in longActDict:
                    continue

                # Judge the target vehicle lateral activity
                curr_interact_tgt_latAct = latActDict[curr_interact_tgt]
                if req_tgt_latAct not in curr_interact_tgt_latAct['LateralActivity'].values:
                    continue
                tgtLatActFram = find_start_end_frame_of_latAct(curr_interact_tgt_latAct, req_tgt_latAct)
                '''
                # Check the target vehicle ramp activity
                curr_tgt_rampActs = tracks_36[tracks_36['trackId'] == curr_interact_tgt]['activity_type'].unique()
                if req_tgt_rampAct not in curr_tgt_rampActs:
                    continue
                '''
                # Find the intersection between ego and target frames
                inter = intersection_judge(egoLatActFram, tgtLatActFram)
                if len(inter) == 0:
                    continue

                # Current ego info
                curr_ego_start_row = tracks_36[(tracks_36['trackId'] == curr_ego) & (tracks_36['frame'] == inter[0])].reset_index(drop=True)
                curr_ego_end_row = tracks_36[(tracks_36['trackId'] == curr_ego) & (tracks_36['frame'] == inter[1])].reset_index(drop=True)
                curr_ego_life = tracks_36[(tracks_36['trackId'] == curr_ego) & tracks_36['frame'].between(inter[0], inter[1])].reset_index(drop=True)
                # Current target info
                curr_tgt_start_row = tracks_36[(tracks_36['trackId'] == curr_interact_tgt) & (tracks_36['frame'] == inter[0])].reset_index(drop=True)
                curr_tgt_end_row = tracks_36[(tracks_36['trackId'] == curr_interact_tgt) & (tracks_36['frame'] == inter[1])].reset_index(drop=True)

                # lane ID 

                 
                if curr_ego_end_row.empty or curr_ego_start_row.empty or curr_tgt_start_row.empty or curr_tgt_end_row.empty:
                    continue
                
                # Check all rows if the 'laneId' column is empty
                if 'laneId' not in curr_ego_end_row or 'laneId' not in curr_ego_start_row or 'laneId' not in curr_tgt_start_row or 'laneId' not in curr_tgt_end_row:
                    continue

                if curr_ego_end_row['laneId'].empty or curr_ego_start_row['laneId'].empty or curr_tgt_start_row['laneId'].empty or curr_tgt_end_row['laneId'].empty:
                    continue

                # Then check if index 0 exists in each Series
                if 0 not in curr_ego_end_row['laneId'].index or 0 not in curr_ego_start_row['laneId'].index or 0 not in curr_tgt_start_row['laneId'].index or 0 not in curr_tgt_end_row['laneId'].index:
                    continue                              
                if curr_ego_end_row['laneId'][0] ==  'Unknown' or curr_ego_start_row['laneId'][0]==  'Unknown' or curr_tgt_start_row['laneId'][0] ==  'Unknown'or curr_tgt_end_row['laneId'][0]==  'Unknown':
                    continue


                curr_ego_start_lane = curr_ego_start_row['laneId'][0]

                curr_ego_end_lane = curr_ego_end_row['laneId'][0]
                curr_tgt_start_lane = curr_tgt_start_row['laneId'][0]
                curr_tgt_end_lane = curr_tgt_end_row['laneId'][0]

                match = re.search(r'\d+', file_path)
                if match:
                    index = int(match.group(0))
                    if 39 <= index <= 52 :
                        ego_drive_direction = curr_ego_end_row['xCenter'][0] - curr_ego_start_row['xCenter'][0]
                        delta_x_tgt_ego_start = curr_tgt_start_row['xCenter'][0] - curr_ego_start_row['xCenter'][0]
                    else :
                        ego_drive_direction = -(curr_ego_end_row['xCenter'][0] - curr_ego_start_row['xCenter'][0])
                        delta_x_tgt_ego_start = -(curr_tgt_start_row['xCenter'][0] - curr_ego_start_row['xCenter'][0])               
                # Calculate the target vehicle position at start  
                #ego_drive_direction = curr_ego_end_row['xCenter'][0] - curr_ego_start_row['xCenter'][0]
                #ego_drive_direction = (curr_ego_end_row['xCenter'][0] + np.cos(np.radians(curr_ego_end_row['heading'][0]))) - \
                #    (curr_ego_start_row['xCenter'][0] + np.cos(np.radians(curr_ego_start_row['heading'][0])))


                #delta_x_tgt_ego_start = curr_tgt_start_row['xCenter'][0] - curr_ego_start_row['xCenter'][0]
                #delta_x_tgt_ego_start = (curr_tgt_start_row['xCenter'][0] + np.cos(np.radians(curr_tgt_start_row['heading'][0]))) - \
                #        (curr_ego_start_row['xCenter'][0] + np.cos(np.radians(curr_ego_start_row['heading'][0])))


                laneDiffStart = curr_tgt_start_lane - curr_ego_start_lane
                curr_tgt_pos_start = pos_calc(laneDiffStart, ego_drive_direction, delta_x_tgt_ego_start, req_tgt_startPos_type)
                '''
                # 这个是否是只针对highD要用到的条件
                # If current target vehicle was not once the leadId of the current ego vehicle, then skip
                if curr_interact_tgt not in curr_ego_life['leadId'].values:
                    continue
                '''
                if req_ego_latAct == 'off-ramp':
                    for i in range(len(curr_ego_latActs) - 2, -1, -1):
                        if curr_tgt_pos_start is None or curr_tgt_pos_start != req_tgt_startPos:
                            egoLatActFram = find_start_end_frame_of_off_ramp(curr_ego_latActs.iloc[:i],egoLatAct_endFrame)
                            inter = intersection_judge(egoLatActFram, tgtLatActFram)
                            if len(inter) == 0:
                                continue

                            curr_ego_start_row = tracks_36[(tracks_36['trackId'] == curr_ego) & (tracks_36['frame'] == inter[0])].reset_index(drop=True)
                            curr_ego_end_row = tracks_36[(tracks_36['trackId'] == curr_ego) & (tracks_36['frame'] == inter[1])].reset_index(drop=True)
                            curr_ego_life = tracks_36[(tracks_36['trackId'] == curr_ego) & tracks_36['frame'].between(inter[0], inter[1])].reset_index(drop=True)
                            curr_tgt_start_row = tracks_36[(tracks_36['trackId'] == curr_interact_tgt) & (tracks_36['frame'] == inter[0])].reset_index(drop=True)
                            curr_tgt_end_row = tracks_36[(tracks_36['trackId'] == curr_interact_tgt) & (tracks_36['frame'] == inter[1])].reset_index(drop=True)

                            curr_ego_start_lane = curr_ego_start_row['laneId'][0]
                            curr_ego_end_lane = curr_ego_end_row['laneId'][0]
                            curr_tgt_start_lane = curr_tgt_start_row['laneId'][0]
                            curr_tgt_end_lane = curr_tgt_end_row['laneId'][0]
                            
                            match = re.search(r'\d+', file_path)
                            if match:
                                index = int(match.group(0))
                                if 39 <= index <= 52 :
                                    ego_drive_direction = curr_ego_end_row['xCenter'][0] - curr_ego_start_row['xCenter'][0]
                                    delta_x_tgt_ego_start = curr_tgt_start_row['xCenter'][0] - curr_ego_start_row['xCenter'][0]
                                else :
                                    ego_drive_direction = -(curr_ego_end_row['xCenter'][0] - curr_ego_start_row['xCenter'][0])
                                    delta_x_tgt_ego_start = -(curr_tgt_start_row['xCenter'][0] - curr_ego_start_row['xCenter'][0])  
                            #ego_drive_direction = curr_ego_end_row['xCenter'][0] - curr_ego_start_row['xCenter'][0]
                            #ego_drive_direction = (curr_ego_end_row['xCenter'][0] + np.cos(np.radians(curr_ego_end_row['heading'][0]))) - \
                            #    (curr_ego_start_row['xCenter'][0] + np.cos(np.radians(curr_ego_start_row['heading'][0])))


                            #delta_x_tgt_ego_start = curr_tgt_start_row['xCenter'][0] - curr_ego_start_row['xCenter'][0]
                            #delta_x_tgt_ego_start = (curr_tgt_start_row['xCenter'][0] + np.cos(np.radians(curr_tgt_start_row['heading'][0]))) - \
                            #        (curr_ego_start_row['xCenter'][0] + np.cos(np.radians(curr_ego_start_row['heading'][0])))
                            laneDiffStart = curr_tgt_start_lane - curr_ego_start_lane
                            curr_tgt_pos_start = pos_calc(laneDiffStart, ego_drive_direction, delta_x_tgt_ego_start, req_tgt_startPos_type)

                            if curr_tgt_pos_start is None or curr_tgt_pos_start != req_tgt_startPos:
                                continue
                        else:
                            break
                        
                if curr_tgt_pos_start == req_tgt_startPos:  # Judge the start position
                    # Calculate the target vehicle position at end
                    #delta_x_tgt_ego_end = curr_tgt_end_row['xCenter'][0] - curr_ego_end_row['xCenter'][0]
                    #delta_x_tgt_ego_end = (curr_tgt_end_row['xCenter'][0] + np.cos(np.radians(curr_tgt_end_row['heading'][0]))) - \
                    #  (curr_ego_end_row['xCenter'][0] + np.cos(np.radians(curr_ego_end_row['heading'][0])))
                    match = re.search(r'\d+', file_path)
                    if match:
                        index = int(match.group(0))
                        if 39 <= index <= 52 :
                            delta_x_tgt_ego_end = curr_tgt_end_row['xCenter'][0] - curr_ego_end_row['xCenter'][0]
                        else :
                            delta_x_tgt_ego_end = -(curr_tgt_end_row['xCenter'][0] - curr_ego_end_row['xCenter'][0])
                    laneDiffEnd = curr_tgt_end_lane - curr_ego_end_lane
                    curr_tgt_pos_end = pos_calc(laneDiffEnd, ego_drive_direction, delta_x_tgt_ego_end, req_tgt_endPos_type)
                    if curr_tgt_pos_end == req_tgt_endPos:  # Judge the end position
                        # If longitudinal activity is omitted, get current targetID and BegFrame, EndFrame
                        if req_ego_lonAct == 'NA' and req_tgt_longAct == 'NA':
                            tgt_list.append(curr_interact_tgt)
                            interFinal = []
                            interFinal.append(inter[0])
                            interFinal.append(inter[1])
                            continue

                        # Judge the ego vehicle longitudinal activity: if 'NA', omit longitudinal
                        if req_ego_lonAct not in curr_ego_lonActs['LongitudinalActivity'].values:
                            continue
                        # Judge the target vehicle longitudinal activity: 
                        curr_tgt_lonAct = longActDict[curr_interact_tgt]
                        if req_tgt_longAct not in curr_tgt_lonAct['LongitudinalActivity'].values:
                            continue
                        egoLonActFram = find_start_end_frame_of_lonAct(curr_ego_lonActs, req_ego_lonAct)
                        tgtLonActFram = find_start_end_frame_of_lonAct(curr_tgt_lonAct, req_tgt_longAct)
                        # intersected frames of longitudinal activity of ego and target
                        interLon = intersection_judge(egoLonActFram, tgtLonActFram)
                        if len(interLon) != 0:
                            # Intersected frames of lateral and longitudinal
                            interFinal = intersection_judge(inter, interLon)
                            if len(interFinal) != 0:
                                tgt_list.append(curr_tgt_start_row['trackId'][0])
                                break

            if len(tgt_list) != 0:
                scenarioList.append(curr_ego)
                scenarioList.append(tgt_list)
                scenarioList.append(interFinal[0])
                scenarioList.append(interFinal[1])

            # Append the scenario list into another list
            if len(scenarioList) != 0:
                scenarioLists.append(scenarioList)
    else:
        req_ego_rampAct, req_tgt_rampAct = get_activity_from_LLM_response_ExitD_Ramp(key_label)
        scenarioLists = []
        for key in tracks_36['trackId'].unique():
            curr_ego = key  # current ego id
            curr_ego_rampActs = tracks_36[tracks_36['trackId'] == curr_ego]['activity_type'].unique()
            if req_ego_rampAct not in curr_ego_rampActs:
                continue

            curr_interact_tgts = interactIdDict.get(curr_ego, [])
            for curr_interact_tgt in curr_interact_tgts:
                if curr_interact_tgt == -1:
                    continue
                curr_tgt_rampActs = tracks_36[tracks_36['trackId'] == curr_interact_tgt]['activity_type'].unique()
                if req_tgt_rampAct not in curr_tgt_rampActs:
                    continue

                scenarioList = [curr_ego, [curr_interact_tgt]]
                scenarioLists.append(scenarioList)


    return scenarioLists

